[
  {
    "post_id": "1of6m3z",
    "source": "reddit",
    "subreddit": "SubredditDrama",
    "author": "livejamie",
    "title": "Destiny’s Community Struggles with Him Staying with a Neo-Nazi OnlyFans Girl on His Cross-Country Tour",
    "content": "## The Man\n\nDestiny is a controversial streamer who started with Starcraft back in the early days but has transitioned into debate content usually around his Neoliberal or Pro-Israel views.\n\nHe was banned from Twitch for transphobic speech (he uses a lot of \"gamer words\") and now streams on Kick.\n\nHe has been accused of being a sex pest numerous times, even going back to the beginning of his career. He's currently in two different legal battles, one for sharing revenge porn on Discord, and a second accusing him of grooming an underage girl. He has admitted to keeping CSAM of her on his computer for legal purposes.\n\nHe and his community were a large driver of the most recent \"Collargate\" drama with Hasan Piker, who is one of his archnemeses.\n\n## The Tour\n\nDestiny is very involved with various Liberal PACs and is currently headlining the cross-country [\"Unfuck America Tour\"](https://www.unfuckamericatour.com/) with other like-minded commentators who are edgy \"no filter\" type Centrist and Neoliberals. It markets itself as the counter to Charlie Kirk's Turning Point USA tour, in which he was assassinated last month.\n\n## The Girl\n\n[EmpathChan](https://x.com/Emp4thchan) is a neo-Nazi Onlyfans E-girl who is best known for [posting edgelord things on twitter like selfies with Swastikas](https://i.imgur.com/tznODLV.jpeg) and recording herself on Kick/Rumble committing hate crimes. [There is an 8-minute compilation of her spitting on homeless people and calling them various slurs.](https://rumble.com/v56uerg-of-girl-spits-on-strangers-for-money.html) (Warning: Disturbing video)\n\nEmpathChan posts a selfie from Destiny's apartment and it's found that she's been staying with him during the tour. Many people theorized they are dating or sleeping with each other.\n\nDestiny says he's asked her to \"chill\" and that he's not having a romantic relationship with her. [He bans anybody who suggests this and says they should kill themselves](https://i.imgur.com/Yv3vP7c.png).\n\nShe later posts a weird racial insult about Destiny's teenage son on Twitter.\n\n## The Post\n\nAn incident happened at the most recent tour stop where EmpathChan is on video calling Darius, a bi-racial ride-or-die Destiny orbiter best known for getting into physical fights with people, the F----t and N----r slurs (hard R), All while she is decked out in \"Unfuck America\" merch.\n\nAttempting to post this to Livestreamfail, the subreddit Destiny and his community run, will get deleted and you banned but it is posted as a \"Honeypot Thead\" and stickied to his personal subreddit. (Meaning anybody who comments in it gets banned): [DramaEmpathchan called Darius the F and N slurs. A megathread.](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/)\n\nNote: Reddit allows banned users to edit existing comments so comments that have an \"Edit\" or an \"o7\" (a salute emote) were made after they got banned.\n\n## The Comments\n\n### A mod stickies Destiny's comment about asking her to chill which gets many responses\n\n> [I’m fucking tired boss.](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkwetgv/)\n>\n> > Strap yourself in buddy.\n> > \n> > > I'd rather jump out of an airplane than strap in, you can't reconcile his political views with openly associating with a schizo nazi cunt with her history and behaviour lmao.\n> > > \n> > > How am I supposed to take anything Tiny says seriously when he associates with this shit, worst thing is, he is regarded and about to double down on the association as well given his track record of never disavowing people who don't openly attack him.\n> > > \n> > > EDIT: Yep, [here](https://www.reddit.com/r/Destiny/comments/1odurcs/destiny_explains_his_recent_association_read/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) is the double down. GG, I am tired.\n> > > \n> > > > I must’ve missed this, when did he start associating with this girl? I found a reddit thread from a year ago claiming that they were talking to each other and this was after or during the discord minor shit she did.\n> > > > \n> > > > Gimme lore\n> > > > \n> > > > > Open his twitter and scroll down to October 20th, then when you find the fated tweet, open it, go to her profile and get your lore by reading through that.\n> > > > > \n> > > > > Just her tweets from today are enough to know that she is fucking mental, alternatively you can really just scroll this thread, people posted plenty of her shit.\n> \n> Not even destiny himself would believe destiny here\n\n---\n\n> Hey, you should really stop spitting on randoms and calling them k----s and n-----s, it could ruin your future! Anyway, how is your Tuesday? You want to tour the country? Amazing. Sure, swing by Miami, that sounds fine!\n> \n> Come the fuck on, dude.\n> \n> o7\n> \n> > Is it that easy to start talking to destiny. Could i just dm him and he would build up a rapport with me for a \"while\".\n> > \n> > > How hot are you\n\n---\n\n> I don’t care if it’s a honeypot thread, associating this person with Unfuck America in any way is diabolical work.\n> \n> \"I have zero sexual or romantic relationship with this person\"\"\n> \n> Just like he had nothing to do with Ana but then it turned out he was sexting her? Yeah right, get fucking real, none if us were born yesterday.\n> \n> > Not the based Queen Ukraine Ana right? Right...?\n> > \n> > > That would genuinely be crushing.\n> > > \n> > > > That would be fine.  \n> > > > My problem isn't that he fucks around, he is a millionaire, he should fuck around, my problem is in who he picks to fuck around with.\n\n---\n\n> He knows what kind of person she is... why even talk and associate with her in any capacity?\n> \n> > Yep. That’s what shocked me. And to retweet her yesterday as well. Why he would platform this person is beyond me.\n> > \n> > > Even if it were true that there's nothing going on between them romantically or sexually–is that better? What other redeeming qualities does this individual have? \n> > > \n> > > I have no idea who she is and this thread is my first exposure to her and I've seen whole compilation videos of her assaulting strangers. \n> > > \n> > > I'm sorry, but at this point after the constant sex addiction fueled self-destructive behavior, I have very little respect for this guy. Ban me and seek help\n\n---\n\n> Does anyone even believe destiny’s claim that he isn’t hooking up with her. He said the same thing about the Lauren southern rumors and which turned out to be a flat out lie. He is definitely hooking up with her.\n> \n> > It's about shooting that Cuban seed into racist Aryan girls. It's kind of kinky\n> > \n> > > She's Irish 🥀\n> > > \n> > > > Irish Aryish Tomato Tomato\n\n---\n\n> They need to chill as in they need to stop spitting on homeless people? Come on man\n> \n> > Darius needs to chill and stop drinking. This chick needs an involuntary stay at a grippy sock facility. These things are not comparable\n\n---\n\n> His best defense is \"I'm not hanging out with her officially or professionally\"\n> \n> He has missed the point entirely.\n> \n> He 100% is aware she's a super racist and STILL continues to chat and associate with her. Any normal person would refuse to communicate with a person who records themselves doing hate crimes.\n> \n> I've only known about Destiny for 2 months now, but I can't trust this dude's judgement anymore. Anyone who chooses to chat with and befriend a known racist can go get fucked\n> \n> > I mean there's Myron, Nick Fuentes, Darius and Xena. Destiny for a long time now does not cut anyone off until they personally come at him. This is not new.\n> > \n> > > I feel like assaulting random people on the street is whole different level compared to what these guys have done. But I guess he hasn't officially brought her into his content so I guess it's slightly different.\n> > > \n> > > > Off the top of my head Xena shot a random woman with a paintball gun and like yesterday we saw Darius punching random people in the street.\n> > > > \n> > > > I do get what you're saying, I agree she's on a different level of straight up insanity. So long as Destiny isn't creating content with or endorsing her that's his own business to deal with, in my opinion.\n> > > > \n> > > > > Has he associated with xena since? But even then that's just one and it was indiscriminate, nazi girl as an 8 minutes compilations of 5~ seconds clips of her assaulting people, that's like a 100 people and it's only what was on camera.\n\n---\n\n> bro is a world famous multi-millionaire streamer. He has way better options than this. If that's what this is about, then his judgement can't be trusted.\n> \n> > I love Steven, but his judgment cannot be trusted when it comes to women. He had a relatively serious romantic relationship with a popular far-right conservative(my nazi queen ❤️). He's said in the past that he likes girls who basically fight with him on everything and how he doesn't like the submissive wallflower type.\n> > \n> > > To be fair to destiny, he just is very bad judge of character overall.\n\n---\n\n> Maybe if progressives weren’t so mean to him he wouldn’t feel compelled to bring a Nazi on tour\n> \n> > What evidence is there that he brought her? It sounds like she decided to come on her own. Like c'mon guys use your brains. \n> > \n> > > Between his messages and the photos of her in his apartment one can assume, but you’re right! He doesn’t accuse her of stalking him which is what I would say if this person decided to follow me across the country against my wishes, but I guess she could’ve showed up without Steven giving anybody a heads up that he’s been chilling with an unhinged Nazi the last few days which would be inconsiderate to the people paying him to say the least\n> > > \n> > > > Not banning her does not mean he brought her along. It's entirely possible that he doesn't care if she's there and she decided to come along and see him. It's a public event that anyone can go to, he doesn't have to announce she'll be there.\n> > > > \n> > > > \"the photos of her in his apartment one can assume\"\n> > > > \n> > > > This is the only thing to me that could be damning and indicate he could be lying. There could be other explanations though.\n> > > > \n> > > > > You sound like an hamasabi fan bro\n\n---\n\n> I hope the benevolent gods don't snipe me for this but tbh being around this person to fuck would have at least been understandable , if there's no sort of relationship involved then idk why he would be around her, the things I've seen about this person seem pretty god damn crazy not gonna lie\n> \n> > No, just no.\n> > \n> > > Why not? It's not like he'd be marrying her\n\n---\n\n### Are you the people you hang around?\n\n> [What happened to \"you are who you hang around?\"](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkzi3cs/) Obviously I don't think Destiny is a nazi or racist, but what is it about your personality that allows you to be okay hanging out with a person like this?\n> \n> Watching the compilation of her walking around and spitting on random black people or homeless people, berating that Indian guy and calling him subhuman, like what is this shit lmao,\n> \n> I just watched D talk about how \"gross\" it feels when he sees someone get bullied, like when someone at his event picked on that person in the audience, genuinely wonder if he does not feel the same way about what this girl does, or why that would not put him off from wanting anything to do with her. I have very limited information as a viewer, I know, but damn.\n> \n> > \"Obviously I don't think Destiny is a nazi or racist,\"\n> > \n> > I do, because 'you are who you hang around'.\n> > \n> > \"I just watched D talk about how \"gross\" it feels when he sees someone get bullied,\"\n> > \n> > right? I feel like this shows he's now pro-bullying. Even if he came out and said 'obviously I disagree with the things she said and did but I don't take hanging out 1-2 times to mean I'm endorsing every good and bad aspect of this person' I wouldn't believe him. How could I? That sounds completely unreasonable.\n> > \n> > The dude is now a pro-bullying nazi\n> > \n> > > I just cannot believe how unreal and brain-broken the people in this sub are lmao.\n> > > \n> > > \"Destiny definitely supports every single thing this internet person has done because of a relationship with her that I have completely fabricated in my head.\"\n> > > \n> > > Downvote if you agree btw.\n> > > \n> > > > Brain-broken is calling yourself a liberal while collaborating with Nazis.\n> > > > \n> > > > [edit](https://streamable.com/oll5eu)\n\n---\n\n### Somebody should count how many strangers she spat on\n\n> [No lessons learned era](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkvzg6h/)\n> \n> > BPD 🗣️\n> > \n> > > Bro after this bullshit-ass year…\n> > > \n> > > [GIF of \"I need it\" Spongebob]\n> > > \n> > > EDIT: Ok I just saw the compilation of this bitch spitting on strangers. This is far worse than a BPD girl. What the fuck is streamer man on?\n> > > \n> > > > 8 minutes worth too i ant watching all that\n> > > > \n> > > > > Someone needs to count how many strangers she spat on, how many she called the f word, and how many she called the hard r. It's hard to believe that it's a lot more than a dozen for each, what the actual hell.\n\n---\n\n### More fans fall victim to the banhammer\n\n> [Freedom of Speech Rockwell meme]\n> \n> [I don’t think a OF nazi shit poster should be at these events](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkw25h6/)\n> \n> > I think it was a dumb as fuck move to invite or bring her to the event. ~~Fuck whoever you want but~~ why have a PR nightmare by having her be there? Her being in Unfuck America gear is just icing on the fuckin cake.\n> > \n> > Edit: got banned, RIP. Disappointed but not surprised.\n> > \n> > Double edit: he states he isn't romantically involved with her so good on him for that at least. I still see nothing positive happening by talking to this person at all or having them at the events but whatever i guess.\n> > \n> > > \"isnt romantically involved?\"\n> > > \n> > > Who are we kidding here, he was planning to and almost surely did fuck her after that event. He is an elite level gooner.\n> > > \n> > > Edit: Banned hehe\n> > > \n> > > > Women are objects to DGGers, in other news Trump still bad\n\n---\n\n### He needs the challenge\n\n> [Why are we always one step forward 15 backwards?!?](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkw3lzc/)\n> \n> > For how smart Destiny is, he really is a dumb fuck.\n> > \n> > > agree, something wrong with this guy brain holy fuck\n> > > \n> > > > Don't think his brains doing the thinking here 07\n> > \n> > because pussy and personal pleasure is his nr.1 priority above all else, no matter the cost\n> > \n> > it has been and always will be like that\n\n---\n\n> > Like playing golf with only one hand because it's too easy for you otherwise, he needs the challenge I guess\n\n---\n\n### Apparently she was posting nudes in his bathroom\n\n> [Tiny needs to up his Vyvanse dosage](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkw1fs5/)\n> \n> Edit: Got banned 😗, banned cause true\n> \n> > posting nudes in his bathroom while tweeting ‘Make Slavery Legal Again’; has Destiny unwittingly created a new level of cuckery?\n> > \n> > > His bathroom confirmed?\n> > > \n> > > > no way to confirm but it sure looks like a guestroom bathroom with US electrical outlets, posted same time as the other tweets from Miami.\n\n---\n\n### She called black people the N word, but being against that doesn't reflect the energy of the community\n\n> [Find better people to hang out you fucking regard, holy shit, that is why everyone treats you like radioactive waste, fucking stop.](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkwmek5/)\n> \n> Ban me you fucking pussy only watched for 12 years, crash and burn and ruin everything like you always do.\n> \n> > Bruh, this has to be a psyop. You’ve been here for 12 years through all the crazy ass scandals, but you draw the line at… hanging out with some edgy OF girl for a day. Not even on stream, didn’t interact with her at the event. You’re just tweaking rn, give the emotions a week or two to settle, then you’ll be back like nothing happened\n> > \n> > > To be fair, this person seems uniquely unhinged in a way that feels meaningfully different from some of the past undesirables lol. I'm just a guy though wtf do I know lmao pls don't ban me\n> > > \n> > > > Yeah, from what I’ve seen this person does seem quite unhinged. But I guess I’m just not making the connection of her being a meaningful part of Destiny’s stream/life. My understanding is he isn’t in any type of relationship with her and has only been casually chatting, and then hung out once in person. I think it’s super valid to feel upset that he’s engaging with such a person, but the reaction in this thread would make me think this is Pxie 2.0\n> > > > \n> > > > > I think people's main issue is the fact that she's at the unfuck america tour calling a black guy the N word and regardless of whether he invited her or not, it's a bad look. I do understand the whole \"Republicans don't care about how awful they are so why should libs\", but at the same time this is pretty fucking insane. Now before I get nuked from orbit, let me say that I don't know if he invited her, at the same time, shit like this should be met with an immediate \"What the actual fuck is wrong with you, don't do that and don't come here\". And if that's not immediate, at least after you figure out what happened and have the details, you ought tell this person not to come to these events. Then if they show up, out of your hands. Maybe behind the scenes he messaged her or something, I hope so because holy fuck she's unhinged lol\n> > > > > \n> > > > > > I think this is pretty reasonable, but it doesn’t at all reflect the energy from this community at the moment.\n> > > > > > \n> > > > > > ***[This comment continues and the thread goes on for a while]***\n> > > \n> > > I'll be honest, I've similarly been around for some length of time over a decade and honestly this one honestly kinda made me feel done too.\n> > > \n> > > Like there was some appeal to the vyvanse putting most of this silly stuff behind him and the current court stuff just being lingering ramifications from past actions.\n> > > \n> > > And it really did feel that way too.\n> > > \n> > > And then this... like I am having literal cognitive dissonance. I think Destiny is one of the smartest people I've seen or heard speak and I simply can't get my brain around this decision.\n> > > \n> > > Either the videos of her walking around spitting on homeless people is fake or I fundamentally misunderstood Destiny's character. Idk.\n\n---\n\n### All these bans are just like Hasan\n\n> [I have some choice words about this whole ordeal especially considering the whole drama that happened at the start of this year.](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkw05pi/) But I'll keep it to myself. At what point do I just give up hoping things would change.\n> \n> > Considering what he's currently dealing with this behavior is absolutely regarded without question. Sucks for all the people including me who have defended him and wished him well through all this shit.\n> > \n> > Edit: yeah just ban anyone rightfully calling you out bro shits on Hasan all day everyday but literally acts just like him what a fucking joke\n> > \n> > > I don't understand how a man can be so smart and so unbelievably stupid at the same time. It's like he hasn't learned anything at all.\n> > > \n> > > Edit:\n> > > \n> > > o7\n> > > \n> > > > Every smart center-left figure has a topic where the logical parts of their brains turn off\n> > > > \n> > > > Bill Maher: Islam\n> > > > \n> > > > Sam Harris: Islam\n> > > > \n> > > > Mehdi Hasan: Islam\n> > > > \n> > > > Destiny: BPD Women\n> > > > \n> > > > There's a reason why Adam Mogler will continue to grow Nationally on Network Television and Destiny will continue to stream. That's just how Dman is wired just accept it and goodluck to all of us\n> > > > \n> > > > Edit: o7 Brothers see you in Valhalla\n\n---\n\n### Some don't like how she promotes her OnlyFans to minors\n\n> [Why the fuck is Destiny hanging out with her?](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkvyz0o/) And inviting her to events?\n> \n> Forget her racism/homophobia on Twitter, she has tried pushing her OF to minors.\n> \n> > No you don't get it shes really intelligent\n> > \n> > edit: o7 hopefully the pussy was worth it\n\n---\n\n> > Because he is a nymphomaniac who throws out all his morals and standards when it comes to sex.\n> > \n> > Aaaaaan im banned. Most sensitive fucking streamer on the internet😂🤣\n\n---\n\n### What he's doing is damaging his center left reputation\n\n> [Thanks tiny for bringing the neo nazi racist as a friend to the anti-neo nazi racist tour!!!!](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkvzsiy/) really cool\n> \n> Edit: i got banned for calling out destiny for hanging out with a person who carves swastikas on themselves. destiny and hasan are fucking twins o7\n> \n> > o7 to all my fallen dggas.\n> > \n> > You have been Witnessed. See you in Valhalla.\n\n---\n\n> > Honestly yeah that’s the worst part. Idrc what tiny does in his personal life but if he wants to be taken seriously in the political world he has to keep these interactions away from that. Like if we’re being honest I believe pretty easily and it’s not fair but Destiny’s personal and relationship drama has hurt his career more than joking about Charlie Kirk. When I try to introduce my friends to him the first things they say is “isn’t that guy a cuck”or “didn’t he fly out a 17 year old”. It’s not true or fair but that’s what a lot of people think of when you bring up Destiny, these aren’t even “political” people. I don’t want to sound like an anti-fan. Steven has done a lot, in a lot of ways was one of the only big center left figures holding the line in the social media space. I think it’s important however we seriously start trying to support and build up other bigger center left personalities like Adam Mockler because realistically I think they will be the ones unfortunately not Destiny to really bring more people to our side.\n\n---\n\n### Some aren't phased and still appreciate him\n\n> [Aba was right about Destiny.](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nl0rrgj/) There is no reason to take his political intentions seriously when he consistently does dumb shit to ruin his own image.\n> \n> > I take his political intentions seriously. He puts in a ton of work and I really appreciate him doing these events as well as the canvassing and other efforts. If he does 10 things and 8/9 of them are positive that's an indication for me that he's serious about this stuff. He's just not perfect. But hey maybe other people have other opinions.\n> > \n> > > \"Not perfect\", meaning consistently involved in scandals ranging from interactions with neo-Nazis to accusations of illegal sexual acts.\n> > > \n> > > No one is perfect, but only Destiny seems to consistently find himself in these situations. Maybe it's a him problem.\n> > > \n> > > > Maybe, maybe not. I still personally take his political intentions seriously and appreciate the amount of work he puts in. Luckily if one doesn't, there are plenty of other political creators to follow and take seriously!\n\n---\n\n### Some don't really care\n\n> [Am I supposed to care who he fucks.](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nky49xl/) Long as it's consensual idc. Y'all are out here talking like homie cheated on you. Get a life! This is how I know some of you are basement dwellers. Otherwise, you'd already know the dick don't care where it lays it's head at night.\n> \n> > I dont care who he fucks, but why is he posting on twitter with her, why do i have to see her calling people the n word on the front of lsf. I dont care about his personal life but its being forced onto me through his tweets, the mass bans, the dgg comments, and its gross lol. Shes a disgusting subhuman loser.\n> > \n> > > What?! You never fucked a disgusting sub human loser? Of course not. You mutha fucks are all about the god-damned optics.Fucking the thing you hate and hates you is cathartic. At this point who gives a shit. You aren't legally obligated to love what you fuck and he is not obligated to do what basement dwellers demand of him. If he Nukes his shit that's his decision. Tiny has accepted he is gonna be on the fringes, because that's who he is. He ain't polite company. He ain't the dude a woman brings home to her father. This is not a man you marry. If you have deluded yourself in believing that you are in some privileged state to change his mind then you are smoking some grade AAA crack cocaine. If you don't like. Pick up and move on. Spew your anti fan shit at Kiwi Farms or Jew Stalkers Discord.\n\n---\n\n### Some argue if this is worse than being associates with Nick Fuentes, another famous Neo-Nazi\n\n> [not sure why there's so many dipshits in this thread instantly assigning massive blame to anyone found within 30 feet of questionable characters.](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkx0627/)  that's the same misguided criticism dumbasses made of Destiny when he was hanging out with Nick Fuentes. you're supposed to be mad when he starts co-signing deranged things they say\n> \n> it wasn't a problem when Hasan talked about BadEmpanada or terrorist propaganda on stream - it was bad when he agreed with everything the terrorists were saying or supported whatever deranged claims BadEmpanada was making\n> \n> come back when it's Destiny making the jokes or retweeting them or supporting her. until then assume they're friends and that he doesn't agree with any of the stupid shit she says\n> \n> > I judge people by the friends they keep, maybe I'm weird like that 🤷\n> > \n> > > So why are you still here given he's friends with Myron, Xena, etc. ? he clearly doesn't find the guilt by association a potent critique; given you think it's unethical what's the motivation for supporting still?\n> > > \n> > > > Myron, Xena, Nick etc haven’t stalked random minorities/homeless people around a city spitting on them, hitting them and calling them slurs on camera. This is a whole world worse of an association.\n> > > > \n> > > > > You..you think this chick is worse than nick fuentes and myron gaines?\n\n*[Cont'd]*\n\n> This chick believes the exact same Nazi bile that Nick and Myron do and perpetuates it on her platforms like they do. The bonus is she is also willing to commit hate crimes on me and my family in public because of our skin colour.\n> \n> So yes, I do think that.\n> \n> > If you genuinely think that I can't help you. Fuentes and myron have huge followings that they are radicalizing to do much worse and vote for people that have done and will do immeasurable damage to this country and the world. The net effect of their extremism is not even comparable to this chick. But if we disagree here then that's fine there is no inconsistency on either side.\n> > \n> > > If she had their platform size, she would do the same. And she is trying to grow her platform to do so. But I’m fine to agree to disagree as well.\n\n*[Cont'd]*\n\n> even if you wanted that to be your position I don't think being an edgelord troll is \"reprehensible.\" you could pick a lot of words but I wouldn't personally use reprehensible\n> \n> > You don’t think spitting on homeless people makes you a reprehensible person?\n> > \n> > > again it depends on the context. is she an america firster who believes brown people don't belong on American soil so she spirs on them to demonstrate her vitriol? or is she a socially awkward tourette's troll bitch outrage farming to draw attention to her onlyfans? the intention matters. I saw some clips in which she was spitting on very much *not* homeless people, I would assume if she spit on homeless people it's just more of the same gag but with a different target, not because she believes homeless people are second-class citizens who deserve to be spit on\n> > > \n> > > I'm not defending her I literally didn't know who this person was 12 hours ago I'm just saying I wouldn't draw conclusions about the fiber of her character based on what I've seen and it sounds like Destiny didn't either\n\n---\n\n### Some are down bad\n\n> [Based as fuck.](https://www.reddit.com/r/Destiny/comments/1odr212/_/nkw1gbx/) Also the tattoos look so bad. I have no idea who these people are but she's cool with me\n> \n> > she will not fuck you, lil bro\n\n---\n\n### Some aren't sure if they're dating\n\n> [Destiny now dating an actually insane person.](https://www.reddit.com/r/Destiny/comments/1odr212/_/nkw1uff/) Seems like if you can scale people up from 1 to 10 on crazy she would be 9-10 and compared to her Lav would be 3-4. Actually demented person. So disappointing. It better be a prank or some shit\n> \n> > Confirmed dating? All I've seen so far is one picture of them together.\n> > \n> > I guess I'm hopeful this is a \"he just met her, he doesn't know her skeletons\" situation.\n> > \n> > > If this was 2-3 years ago, I would agree with you. But there have been countless times where it was later revealed that a girl that he was \"just friends\" with was someone that he was also fucking.\n> > > \n> > > > It's extremely obvious he wants to fuck her. No way in hell destiny is going after a nazi, homeless abuser, freak unless he wants to fuck them.\n> > > > \n> > > > I'd also like to add that it was, at times, obvious that destiny was fucking chicks he brought on stream. Lauren southern being a prime example.\n\n---\n\n### Destiny is just an ugly version of Hasan\n\n> [destiny is a great example of survivorship bias manifesting within 1 single person](https://www.reddit.com/r/Destiny/comments/1odr212/empathchan_called_darius_the_f_and_n_slurs_a/nkyav7d/)\n\n> political beliefs aside, he's just ugly hasan who tells you he's a bad person instead of hiding it.\n\n> He's bad but always better than the people criticizing him! That's the MO, dman has stuck to that since 2016\n>\n> > They should ban her from events and he shouldn't retweet, outside of that there is nothing harmful or unethical about any supposed private interaction and I have yet to see anyone make a convincing argument about that specifically. If you think 'he's bad' why engage with the community?\n> >\n> > > I'm not talking about this one single event\n\n> > > and I engage with him/this community for the political conversations and basic new/social media stuff. I agree with alot of his political views I just think he's bad person interpersonally or whatever lol like I wouldn't want to be his friend and would probably think less of any of my friends if they showed up with a \"destiny\" type person lol\n\n> > > he's got bad vibes\n> > >\n> > > > Ok, if you don't think there's something unethical in the situation I described and your only point is \"I think destiny is a bad person\" that's fine but you can't be surprised I assumed this comment is in reference to the subject of the thread itself.\n> > > > \n> > > > > ok lol\n\n> > > > >\n> > > > > > This is the \"destiny\" type person you were talking about\n\n> > > > > >\n> > > > > > >  yeah this weird need they have to defend everything destiny does in a very cold and calculated way is so obviously missing the point its almost satirical lol they are doing the thing!\n\n----\n\nPlenty more in the linked thread, which has over 1000 comments as of this posting.",
    "url": "https://www.reddit.com/r/SubredditDrama/comments/1of6m3z/destinys_community_struggles_with_him_staying/",
    "score": 2303,
    "num_comments": 1300,
    "created_at": "2025-10-24 19:12:13+00:00",
    "permalink": "https://reddit.com/r/SubredditDrama/comments/1of6m3z/destinys_community_struggles_with_him_staying/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oeo320",
    "source": "reddit",
    "subreddit": "SubredditDrama",
    "author": "1000LiveEels",
    "title": "\"One of the most insane updates to any video game ever.\" A new update to Counter-Strike 2's skin system causes the in-game economy to crash, with IRL consequences.",
    "content": "**WARNING: THIS POST HAS MENTIONS OF SUICIDE**\n\n**Context**: Hoo boy. This is going to be a lot. I've got way too many hours in this video game, so I'm just gonna kind of ramble from knowledge here. \n\nCS2 is a game that has weapon skins, which [cost real-life money to purchase](https://steamcommunity.com/market/search?appid=730). They have very little bearing on actual gameplay (*maybe* a little bit of camo) and they can be acquired from a case, which is usually free (or extremely cheap) but requires a key which costs $2.50 to open. (A lootbox). Skins come in 6 tiers, which correspond to their rarity in cases. They are Consumer Grade, Industrial Grade, Mil-Spec, Restricted, Classified, and Covert.* Knives and gloves are the most expensive because they are *solely* part of the Covert tier, even though the Covert tier does include skins for guns as well. **The important part**: Traditionally, skins could be used in a \"trade up contract,\" which is a mechanic where you can input 10 skins of one tier to get 1 skin of a higher up tier. **Historically**, you could NOT trade up a covert *gun skin* to a covert *knife / glove* skin. Just wouldn't work. The *only* way to receive a knife / glove skin was to get them from a case, or you could purchase them outright. This lead to them having the highest price by far partly because they were so rare, but also because you couldn't trade up for them.\n\n*(There's also Contraband which only includes two skins that were taken out of cases due to copyright infringement.)\n\nWhat the new update does is makes it so you have the ability to trade up 5 covert skins to receive a knife / glove skin. Because knives and gloves are by far the most expensive (outside *a few* rare gun skins), this caused the price of knives and gloves to *plummet* while the price for covert gun skins *soared* as people bought them up to try and trade for a knife / glove. \n\nFor an added bit of context so you can really get how pissed off people are about this, covert skins in my experience are *at minimum* going to cost ~$50 prior to this update (with a few exceptions), while *most* knives are in the hundreds with quite a few in the *thousands*. Yes, people are spending thousands of dollars on pixels, welcome to 2025.\n\nA big player in this in-game economy is China. I can't get into all the specifics here, but there is a common trend of Chinese \"whales\" (extremely rich people) \"investing\" in video game items like CS skins. A great many of CS's \"whales\" are indeed Chinese. This is why a lot of players here mention China.\n\nLastly, it should be mentioned that knives and gloves which are traded up for are **tradable,** which is a whole can of worms in itself but basically this means that the knives can be transferred to other people which means people can make *real* money on them. I know I said you *spend* real money on them, but normally you can only make back Steam wallet money, which cannot be converted back to real money. If you can trade a skin, you can sell it to somebody.\n\n**Note**: I'm posting links from multiple subs here since the CS fanbase is very stratified across reddit. \n\n**Drama**:\n\nPost 1: **[Counter-Strike 2 Update for 10/22/2025](https://www.reddit.com/r/GlobalOffensive/comments/1odnael/counterstrike_2_update_for_10222025/)**\n\n> AM I READING THE CONTRACTS CORRECTLY??}??\n\n>> Wtf is this haha.\n\n>> Will the cheap reds now be very expensive?\n\n>>> [They're all gone now LMAOO DUDES LMAAOOOOOO HAHAA WHAT A STUPID FUCKING UPDATE WTF IS THIS I GOT A FKIN BUTTERFLY](https://www.reddit.com/r/GlobalOffensive/comments/1odnael/counterstrike_2_update_for_10222025/nkv6wyr/)\n\n> [Excuse me is this a troll???? You can exchange coverts to a knife now????](https://www.reddit.com/r/GlobalOffensive/comments/1odnael/counterstrike_2_update_for_10222025/nkv4kuu/)\n\n>> That's fucking crazy for the skin economy lmfao\n\nPost 2: **[Unpopular opinion: This update is nice for the avg player](https://www.reddit.com/r/GlobalOffensive/comments/1oe7qc0/unpopular_opinion_this_update_is_nice_for_the_avg/)**\n\n> [B-b-but the youtuber with a million dollars worth of knives and gloves said otherwise...](https://www.reddit.com/r/GlobalOffensive/comments/1oe7qc0/unpopular_opinion_this_update_is_nice_for_the_avg/nkzchpd/)\n\n>> [deleted]\n\n>>> Average people don’t have skins for something as retarded as “investments”. These pixels were never worth any money to begin with.\n\n> People who had their main investments in CS skils deserve it for being dumb as fuck\n\n>> [You can say same about all investment. Some company can make stupid decision and fall down, Valve did it today. Without decision from Valve it was good and profitable](https://www.reddit.com/r/GlobalOffensive/comments/1oe7qc0/unpopular_opinion_this_update_is_nice_for_the_avg/nkzne6g/)\n\n> [Absolutely a popular opinion amongst those who don't have hundreds of thousands of dollars in skins](https://www.reddit.com/r/GlobalOffensive/comments/1oe7qc0/unpopular_opinion_this_update_is_nice_for_the_avg/nkzdz8g/)\n\n>> What about the average player who doesnt have any skins and wanted to buy their first covert? They must be so happy right now, no?\n\n> [That's complete nonsense. There are plenty of \"average\" players who have a simple knife. It's precisely these simple players who have lost a lot of money today. The really wealthy collectors have items that are so rare anyway that they will continue to remain very expensive and rare](https://www.reddit.com/r/GlobalOffensive/comments/1oe7qc0/unpopular_opinion_this_update_is_nice_for_the_avg/nkzcz2q/)\n\n>> I have a knife that I'm never planning on selling and after today nothing about that statement has changed but I lost a lot of theoretical cash today >:(\n\n> Do you idiots not understand demand?\n\n> If everyone has one, it won’t be special anymore. If everyone can get the knife they want, it won’t be cool to see anymore.\n\n> No demand=no value. No one will care about your Doppler if every regular broke Joe has one.\n\n>> Get a girlfriend bud\n\nPost 3: **[A Chinese student died after jumping off a building today due to the new CS2 item update polic](https://www.reddit.com/r/cs2/comments/1oe03cj/a_chinese_student_died_after_jumping_off_a/)**\n\n> Investing in what you can’t afford to lose is stupidity especially in unregulated business\n\n>> [Someone doesn’t have a cool knife](https://www.reddit.com/r/cs2/comments/1oe03cj/a_chinese_student_died_after_jumping_off_a/nkysn5a/)\n\n>>> guess what? your knife is a common item now\n\n>> [unregulated? it is regulated, by valve and its specifically stated that they can basically do whatever they want with it lol. people are fucking stupid going in with big money into this](https://www.reddit.com/r/cs2/comments/1oe03cj/a_chinese_student_died_after_jumping_off_a/nkyc4dk/)\n\n>>> \"regulation\" in this context means regulated by a government organization, not a private company.\n\n>> [True but you can still have fun with what you can afford to lose. Its an economi game within a shooter game.](https://www.reddit.com/r/cs2/comments/1oe03cj/a_chinese_student_died_after_jumping_off_a/nky3lpr/)\n\n>>> Yeah but if people are jumping off of buildings because of a few pixels, then I dont think its very fun, which is what OP was talking about man.\n\n>>>> Just wait till you hear about the stock marked.\n\n> Its actually fucking crazy people are blaming valve for this\n\n>> [It is them to blame for creating a gambling market system within their shooter aimed for kids](https://www.reddit.com/r/cs2/comments/1oe03cj/a_chinese_student_died_after_jumping_off_a/nky0nur/)\n\n>>> Valve created the game, community created the skins (majority of them atleast), the hype and the prices of skins. Valve never put a price tag on them until recently with the terminal or whatever its called again, and even that \"case\" sets the price based on the community, less people buy the skins, the cheaper they get. So no, it was not valve, it was all these gambling skin addicts who created the market, it is actually against the ToS to sell them for actual currencies.\n\n> Unfortunately true. This is absolutely a tragedy and my deepest sincerities to his family and loved ones, but it's not entirely Valve's fault. Frankly OP I think it's disgusting you would capitalize on this kid's death to perpetuate your rhetoric.\n\n>> [95% volvos fault](https://www.reddit.com/r/cs2/comments/1oe03cj/a_chinese_student_died_after_jumping_off_a/nkxtcoj/)\n\n>>> Not their fault at all. If he invests in a system without understanding the potential worst case it's entirely his fault for not being able to handle the worst case. That's how investing works.\n\nPost 4: **[Ohne is going to have a hell of a morning](https://www.reddit.com/r/cs2/comments/1odrgtv/ohne_is_going_to_have_a_hell_of_a_morning/)** [editor's note: OhnePixel is a pretty popular CS2 streamer whose primary focus is on \"skin investing.\" Also, yes we are back to more light hearted stuff.]\n\n> Ohne moving to valorant after this 100%\n\n>> [And can you blame him](https://www.reddit.com/r/cs2/comments/1odrgtv/ohne_is_going_to_have_a_hell_of_a_morning/nkw5psu/)\n\n>>> Yes? The idea of investing in a market where an omnipotent entity can manipulate, inflate, crash or even just nuke it whenever they want is insanity. Like, do any of you people realize Valve could just, out of the blue, remove stickers from the game completely and all your Millions in Katowice bucks turn into toilet paper? It was a rigged game from the start, you can't be mad now that you've lost. \n\n> Is it really crashing right now? Whats happening? Haven't logged on in months.\n\n>> [5 reds can be traded up to a gold.](https://www.reddit.com/r/cs2/comments/1odrgtv/ohne_is_going_to_have_a_hell_of_a_morning/nkw4xl7/)\n\n>>> Holy fuck that's trash.\n\n> [Valve just killed cs economy](https://www.reddit.com/r/cs2/comments/1odrgtv/ohne_is_going_to_have_a_hell_of_a_morning/nkwb79r/)\n\n>> lol. knvies and gloves are cheaper, much of everything else is more expensive. prices shifted to adjust the new economy, nothing's killed\n\nPost 5: **[This Chinese skin trader lost about $900k today.](https://www.reddit.com/r/cs2/comments/1oe0fmx/this_chinese_skin_trader_lost_about_900k_today/)**\n\n> \"Skins are for playing, not for speculation.\" - Chairman Gabe\n\n>> [Unironically a based statement from Xi](https://www.reddit.com/r/cs2/comments/1oe0fmx/this_chinese_skin_trader_lost_about_900k_today/nky62ik/)",
    "url": "https://www.reddit.com/r/SubredditDrama/comments/1oeo320/one_of_the_most_insane_updates_to_any_video_game/",
    "score": 1317,
    "num_comments": 357,
    "created_at": "2025-10-24 04:05:57+00:00",
    "permalink": "https://reddit.com/r/SubredditDrama/comments/1oeo320/one_of_the_most_insane_updates_to_any_video_game/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1odxk0c",
    "source": "reddit",
    "subreddit": "sysadmin",
    "author": "reni-chan",
    "title": "I genuinely struggle to find any use case for AI",
    "content": "When ChatGPT first hit the market I was genuinely impressed, but then I played with it for a few hours and quickly learnt that it's pretty dumb. Fast forward to today and I still test various glorified keyword predictors a.k.a AI from time to time and it's mostly the same slop generator as it always was. \n\nTake my job for example, mainly dealing with networks and linux. If you give it a description of a problem and ask for suggestions, it always spills out the same slop which usually goes like \"check the obvious thing A, then another obvious thing B, and if it fails consult user manual\". Wow thanks, I've already tried all of that, that's why I'm searching for the solution online now. And don't even get me started on it inventing brand new commands that do not exist. \n\nWhat I noticed though is that a lot of my let's call it less technically gifted colleagues seem to love it. They use it every day and think they're great at their job, leaving the mess for me to often clean up after. If they manage to implement/fix something using AI it often results in super insecure implementations or messed up configs that affect other services they haven't considered. The AI slop gets copied into emails, tickets, teams messages; It's everywhere to the point I can spot it from miles away and usually just chose to completely ignore it. \n\nThe only good use case I observed is that some of my foreign colleagues use it to clean up their English grammar when sending emails. Pretty cool I guess, however as someone whose English is not their first language I believe that the only way to learn a language is to make mistakes.\n\nMy company is now pushing co-pilot and encourages everyone to use it to improve productivity, is there any good use case for it that I am missing? It genuinely feels to me like it's a tool to enable people who just can't read, write or think on their own.\n\nEdit: Ok, plenty of comments here. The ones were people claim it to be useful talk about using it to digest data, filter through documentation, or use it as a base for quick scripts. I will try to force myself to use it like that and see where it goes.",
    "url": "https://www.reddit.com/r/sysadmin/comments/1odxk0c/i_genuinely_struggle_to_find_any_use_case_for_ai/",
    "score": 772,
    "num_comments": 818,
    "created_at": "2025-10-23 08:11:03+00:00",
    "permalink": "https://reddit.com/r/sysadmin/comments/1odxk0c/i_genuinely_struggle_to_find_any_use_case_for_ai/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1odpqv7",
    "source": "reddit",
    "subreddit": "LeopardsAteMyFace",
    "author": "Mindless_Tumbleweed2",
    "title": "Cattle ranchers who voted for Trump are now panicking.",
    "content": "",
    "url": "https://www.reddit.com/gallery/1odpqv7",
    "score": 1691,
    "num_comments": 226,
    "created_at": "2025-10-23 00:52:47+00:00",
    "permalink": "https://reddit.com/r/LeopardsAteMyFace/comments/1odpqv7/cattle_ranchers_who_voted_for_trump_are_now/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ofiiru",
    "source": "reddit",
    "subreddit": "PersonalFinanceCanada",
    "author": "baby_sun",
    "title": "My Dad gambled away our family's house",
    "content": "My (29F) Dad (62M) has had a gambling problem my entire life. When I was a kid, it was gambling away money meant for my birthday gift or blowing his severance at the casino. But as I got older it turned into bigger things like not paying the utilities, mortgage, and random credit cards.\n\nHe's taken out a credit card in my Mom's (61F) name and maxed it out. He's stolen money from my sister's (25F) debit account that was attached to his and said he was going to pay her back (Spoiler Alert: he never did). He asked me to take out a loan with OSAP that I didn't need, so he could use the 3k they loaned me to pay bills. Then he didn't pay the loan he made me take out, and I discovered my credit score was in the 500s\\~ at 21. Today, my credit score is 795 after years of hard work. He has selfishly hurt every member of my family financially.\n\nIn the last 10 years or so, this financial pain has primarily been focused on our family house. I didn't know the specifics of it until recently, because I don't live there anymore (I live in a condo my fiancée owns), but I knew that the house had been appraised multiple times over the last decade and the mortgage had been consolidated multiple times. I also know that he has randomly asked my Mom for huge sums (anywhere from 3k-20k) because of some huge bill that he hasn't paid/let accrue over time.\n\nThis past week was the big reveal. He came to me and begged me for 27k otherwise they would lose the family house on Nov 12th. I told him I wouldn't let him suck me in and ruin my life too, and that he deserved this, but my Mom and sister don't. I ended up looking at the mortgage paperwork that he sent me and I almost passed out.\n\nThe mortgage on the house is 890k and they bought it for 350k in 2005. They've been paying into it for 20 years and have basically no equity in it. On top of that the interest rate is 8.99% because his credit is so bad. My heart broke for my Mom the most when I saw all this. She's the one who came up with the entire 60k downpayment back in 2005, while living in Community Housing. She's the one that saved money for both me and my sister to go to school, so we didn't have to pay a dime. Seeing that insane number, I realized he had completely ruined her and by extension, my sister and I.\n\nI immediately took control of the situation as best I could:\n\n* I got into my Mom's CRA account and changed the passwords and contact info for her (to her contact) and updated her deposit information to her own account.\n* My sister went with her to Service Canada and got her deposit info and contact info changed to her information.\n* I got access to all the utility accounts and the mortgage accounts and updated the info so I can manage them.\n* I made my Dad (temporarily) route his salary and my Mom's salary both to her account as I will be now be managing paying the bills out of her account. For more context, my Mom is an immigrant who isn't fluent in English or very technically savvy, which is why I am handling this.\n* They both signed up for their pensions and are actively receiving them. My Dad received around $800 and my Mom received $250.\n\nMy Dad makes 80k and my Mom makes anywhere from 75-100k a year as a freelancer. My Mom is a good saver but she only has about 10k in savings because my Dad has constantly been taking money from her over the years. Despite making good money she has never been able to significantly save. The 10k in her savings is also AFTER giving my Dad the 27k he needed because she didn't want to be homeless. The 27k was 2 months of unpaid mortgage payments + interest. And mind you, my Mom was giving him thousands of her proportional share of the mortgage and utilities during these 2 months.\n\nNow I'm trying to figure out what the best next step should be. My Mom wants to divorce him (when it's financially feasible) and sell the house. It's a detached 4-bed 3-bath in Durham Region that has been well maintained.\n\nThey want to wait until March 2026 to sell the house due to the market being bad in the Winter but the mortgage situation is so bad, I feel like they shouldn't even wait another second.\n\n* Option #1: Sell the house now > They just about break even or walk away with minimal profits > My mom and sister get a condo and my Dad stays with his sister\n* Option #2: Sell the house in a few months > Still owe money due to the house selling for too low a price or closing fees > They declare Bankruptcy > I have to take care of my Mom or both of them together because they can't even get a rental\n* Option #3: ???\n\nPlease help a daughter out. I feel like I'm drowning, trying to manage my family financial crisis while also working, paying my own living expenses, and trying to save to buy a house with my partner.\n\nI know it's not technically my job and all that jazz, but my Dad is a gambling addict and my Mom simply isn't financially literate enough to do what needs to be done. I need to help my Mom get out of this mess, but I don't know what to do.\n\n**EDIT:** \n\nThank you for all the appropriately horrified responses. It's very validating, because I haven't talked about this with many people IRL due to the sheer scale of it and how embarrassing it feels. I just want to clear up some misconceptions and questions from the comments.\n\n* I have never co-signed a loan for my Dad or given him any money. My sole misstep was the OSAP loan at 21. I have never allowed him to sway me after he did that to me.\n* My sister has never willfully given him any money. All the money he's taken from her was him stealing from a child account he set up for her. \n* I'm being vague for anonymity sake: my Mom works 1:1 with wealthy families in downtown Toronto and she has a client book dating back to the 80s. That is how she's been able to make so much without being fluent in English. \"Not being fluent\" doesn't mean she has no skills.\n* My parents don't have a joint account. A few years ago after another financial episode with all the same players (random high ticket bill, begging and crying, the whole shebang) I took my Mom to CIBC and set her up with her own debt and credit. He has no access to this account.\n* My fiancée knows about the whole situation and is supporting me through this emotionally. \n* \"This is fake it's AI\" I really wish it was! But no, he's just that cartoonishly evil.\n* \"Who would give them a 9% rate? Fake story\" There are private lenders that offer high-risk and high-interest loans to people with horrible credit with the hope that they will foreclose. My Dad has a mortgage with a private lender.\n\nI will contact a LIT and get the house on the market immediately. I am going to try going for power of attorney for my Mom (she is onboard). I am not concerned with what my Dad is going to do at this point and I will not give him any money or co-sign anything to keep him afloat. Thank you again everyone for the kind (and some harsh lol) words. I really needed to hear all of this.",
    "url": "https://www.reddit.com/r/PersonalFinanceCanada/comments/1ofiiru/my_dad_gambled_away_our_familys_house/",
    "score": 866,
    "num_comments": 284,
    "created_at": "2025-10-25 04:31:26+00:00",
    "permalink": "https://reddit.com/r/PersonalFinanceCanada/comments/1ofiiru/my_dad_gambled_away_our_familys_house/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oepli5",
    "source": "reddit",
    "subreddit": "robloxhackers",
    "author": "cool_dude12321",
    "title": "What's the Synapse X of today? Or best executor on the market?",
    "content": "I wanna get back into making/selling scripts, haven't really exploited since Synapse X shut down but I still have the knowledge of everything. What's the meta of exploiting rn? I don't mind spending a bit of money, just want something that's good and trusted.",
    "url": "https://www.reddit.com/r/robloxhackers/comments/1oepli5/whats_the_synapse_x_of_today_or_best_executor_on/",
    "score": 3,
    "num_comments": 17,
    "created_at": "2025-10-24 05:33:57+00:00",
    "permalink": "https://reddit.com/r/robloxhackers/comments/1oepli5/whats_the_synapse_x_of_today_or_best_executor_on/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ohhexd",
    "source": "reddit",
    "subreddit": "Philippines_Expats",
    "author": "Immediate-Ad-6306",
    "title": "Philippine Tourism is in Crisis",
    "content": "Hi Guys!\n\nSo I've seen quite a few negative articles over the past few days lamenting the state of the Philippine tourism industry (links below).\n\nThe figures are not great;\n\n* **There were 5.9 million visitors in 2024. That's 24% below their target.**\n* **Only 2.1 million of SouthEast Asia's 48.5 million tourist arrivals for the first four months of the year were to the Philippines**\n* **It ranks 7th out of 9th in South East Asia - below even Cambodia**\n* **The numbers today are 30% below the pre-pandemic high in 2019.**\n* **Cebu hotels reported that their occupancy rates are now back to pandemic levels.**\n\nSo what's going wrong?\n\nMy two cents on this;\n\n1. It's too expensive. The Philippines is now actually quite an expensive destination. 'Touristy' activites like resorts, meals, golf, activities are all overpriced. Just last week I was speaking to a group of Canadian guys at a Mactan resort who were complaining it was more expensive than back home! Once you price yourself into that 'mid-market' space there are so many other destinations that offer more. Even domestic tourists are opting to go to Taiwan or Hong Kong because it's working out cheaper.\n2. Bad PR. For the record, I don't think the Philippines is that dangerous a place as long as you're sensible. But it doesn't matter, the *perception* is that it is. They just haven't done enough to create an imagine of a safe destination, especially for families.\n3. It's exhausting. There just isn't the infrastructure to support large scale tourism and no matter how well you plan your trip, you'll probably still end up in the rain at some point trying to haggle with a taxi driver to get back to your hotel.\n4. Lack of exotic intrigue. This might be a bit harsh, but is there *really* much to see? I mean, sure there's good beaches, but they don't seem to get that mid-market tourists don't want to sit on a beach for two weeks. It's not a cultural wasteland, but in Cebu for example, you can do Magellan's Cross and Santo Nino in 20 minutes. The museums haven't had investment and you feel they could have done so much more - Lapu Lapu v Magellan could have been spun into a tourist site in Mactan but there's absolutely nothing.\n\nThey seem to be trying to convince Indians (with free visas), Israelis, etc to come and visit but I mean is this the new generation of tourist their trying to attract? Are they really going to spend big?",
    "url": "https://www.reddit.com/r/Philippines_Expats/comments/1ohhexd/philippine_tourism_is_in_crisis/",
    "score": 499,
    "num_comments": 389,
    "created_at": "2025-10-27 15:25:52+00:00",
    "permalink": "https://reddit.com/r/Philippines_Expats/comments/1ohhexd/philippine_tourism_is_in_crisis/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1odjctk",
    "source": "reddit",
    "subreddit": "TopStepX",
    "author": "TriggeredAF420",
    "title": "What made the futures market dump today?",
    "content": "",
    "url": "https://www.reddit.com/r/TopStepX/comments/1odjctk/what_made_the_futures_market_dump_today/",
    "score": 1,
    "num_comments": 12,
    "created_at": "2025-10-22 20:20:30+00:00",
    "permalink": "https://reddit.com/r/TopStepX/comments/1odjctk/what_made_the_futures_market_dump_today/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oii36u",
    "source": "reddit",
    "subreddit": "GameDevelopment",
    "author": "MiserableDrive2652",
    "title": "What’s the most effective way to market an indie game today?",
    "content": "Hey everyone!\n\nI’m an indie dev working on a small game and I’d love to hear from people who’ve been through the process, what’s actually working for marketing in 2025?",
    "url": "https://www.reddit.com/r/GameDevelopment/comments/1oii36u/whats_the_most_effective_way_to_market_an_indie/",
    "score": 2,
    "num_comments": 8,
    "created_at": "2025-10-28 18:57:30+00:00",
    "permalink": "https://reddit.com/r/GameDevelopment/comments/1oii36u/whats_the_most_effective_way_to_market_an_indie/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oepmq5",
    "source": "reddit",
    "subreddit": "ROBLOXExploiting",
    "author": "cool_dude12321",
    "title": "What's the Synapse X of today? Or best executor on the market?",
    "content": "",
    "url": "/r/robloxhackers/comments/1oepli5/whats_the_synapse_x_of_today_or_best_executor_on/",
    "score": 1,
    "num_comments": 8,
    "created_at": "2025-10-24 05:36:04+00:00",
    "permalink": "https://reddit.com/r/ROBLOXExploiting/comments/1oepmq5/whats_the_synapse_x_of_today_or_best_executor_on/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1og8019",
    "source": "reddit",
    "subreddit": "whatcarshouldIbuy",
    "author": "Jacobs4525",
    "title": "Just buy a miata or something else cool [rant]",
    "content": "You know what breaks my heart? Coming on here and reading this over and over:\n\n>I am a late 20s/30s single person/DINK looking for a new car with a budget of $35k. I will mostly use it for commuting and errands (and presumably do not tow anything or do any serious offroading). Should I get a RAV4, CRV, Forrester, or a CX-5?\n\nWhat the heck is wrong with everyone? \"Hey let me buy a boring car for families with kids at the one point in my life when I might be able to drive something interesting!\" is a statement dreamt up by the terminally boring. Why do you need a car with seat heights optimal for putting a car seat in if you don't have kids? Why do you need even more ride clearance than I, a person who is probably 90th percentile outdoorsy, have ever needed? I have only ever driven regular cars and frequently go on dirt tracks you mfs in crossovers would not dare attempt to get to trout streams.\n\nSUV marketing has been so damn effective that people legitimately think they *need* an SUV for just basic commuter practicality. They think they *need* one if they go to a trail head 1-2 times a year, as if the wheels of a regular car fall off when they touch a road that isn't paved. \n\nWhat is this depriving us of as a society? I think of my dad daily driving a Miata when I was a kid (and the ever present set of steelies with snow tires for it in the garage), and my older coworkers talking about the cars they owned and loved as younger guys in the 80s, 90s and 2000s: 240SXs, Honda Preludes, Toyota Celicas, RX-7s, et cetera. It seems like single folks in good-paying white color jobs in their 20s and 30s today are completely brainwashed by SUV marketing. They don't even consider that they are at the point in their life at which they can actually most enjoy a thing that is just a boring chore that we all have to do to most people.\n\nWe also live in an era of a lot of quite good and eminently reliable daily-able fun cars! The ND Miata is the most daily-drivable Miata ever (and a lot of people enormously underestimate how well it can actually be used as an only car). The BRZ, GR Corolla, WRX, and Civic Si/Integra are all out there for similar prices than what people are paying for most crossovers these days, and those last few aren't even really that much of a sacrifice in terms of practicality!\n\nWhenever a person without dependents who is in a position to drop 30+ grand on a new car asks you what they should buy, you have an obligation to tell them not to be boring. It is your civic (si) duty. Thank you for coming to my TED talk. ",
    "url": "https://www.reddit.com/r/whatcarshouldIbuy/comments/1og8019/just_buy_a_miata_or_something_else_cool_rant/",
    "score": 395,
    "num_comments": 281,
    "created_at": "2025-10-26 01:17:06+00:00",
    "permalink": "https://reddit.com/r/whatcarshouldIbuy/comments/1og8019/just_buy_a_miata_or_something_else_cool_rant/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ohu1y0",
    "source": "reddit",
    "subreddit": "FXPulse",
    "author": "rodiias",
    "title": "Market Dips 5% Today: What's Fueling the Panic",
    "content": "",
    "url": "https://i.redd.it/srjl2804oqxf1.jpeg",
    "score": 6,
    "num_comments": 1,
    "created_at": "2025-10-27 23:28:14+00:00",
    "permalink": "https://reddit.com/r/FXPulse/comments/1ohu1y0/market_dips_5_today_whats_fueling_the_panic/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oilk20",
    "source": "reddit",
    "subreddit": "10xPennyStocks",
    "author": "alwinbaby1994",
    "title": "What the heck happened to the market today?",
    "content": "",
    "url": "https://www.reddit.com/r/10xPennyStocks/comments/1oilk20/what_the_heck_happened_to_the_market_today/",
    "score": 3,
    "num_comments": 1,
    "created_at": "2025-10-28 21:09:17+00:00",
    "permalink": "https://reddit.com/r/10xPennyStocks/comments/1oilk20/what_the_heck_happened_to_the_market_today/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oif27f",
    "source": "reddit",
    "subreddit": "Superstonk",
    "author": "WhatCanIMakeToday",
    "title": "$24B+ Financial Life Support Today",
    "content": "After $8.4 Billion was borrowed from the Lender of Last Resort yesterday when GME dipped to $2.95 overnight \\[[WCIMT on X](https://x.com/WhatCanIMT/status/1982791084452303295), [Federal Reserve](https://www.newyorkfed.org/markets/desk-operations/repo)\\], today we have a whopping **$24B+** provided by THREE Central Banks (Federal Reserve, Bank of England, and Bank of Japan) \\[[WCIMT on X](https://x.com/WhatCanIMT/status/1983164167042543777)\\].\n\n# $7.753B from Federal Reserve 🇺🇸\n\n[https:\\/\\/www.newyorkfed.org\\/markets\\/desk-operations\\/repo](https://preview.redd.it/47ufacy1wvxf1.png?width=534&format=png&auto=webp&s=508441693840e29a7824bd04e4fd5bd1b67e427a)\n\n# £3.8B (~$5B) from Bank of England 🇬🇧 ILTR\n\n[https:\\/\\/www.bankofengland.co.uk\\/markets\\/bank-of-england-market-operations-guide\\/results-and-usage-data](https://preview.redd.it/smbyox66wvxf1.png?width=1146&format=png&auto=webp&s=e81c25082c6cf7e9141d1e3458c65ea8d285c2a0)\n\n# ¥1,756B (~$11.5B) from Bank of Japan 🇯🇵 \n\n[https:\\/\\/www.boj.or.jp\\/en\\/statistics\\/boj\\/fm\\/ope\\/index.htm](https://preview.redd.it/rq4jupqcwvxf1.png?width=4334&format=png&auto=webp&s=51529236cfd054a7c710c5e10ddc47f180065043)\n\n",
    "url": "https://www.reddit.com/r/Superstonk/comments/1oif27f/24b_financial_life_support_today/",
    "score": 1247,
    "num_comments": 83,
    "created_at": "2025-10-28 17:04:41+00:00",
    "permalink": "https://reddit.com/r/Superstonk/comments/1oif27f/24b_financial_life_support_today/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ohq4yx",
    "source": "reddit",
    "subreddit": "Accounting",
    "author": "Blockchainauditor",
    "title": "What does AI have to do with Josiah Wedgwood, Charles Darwin's grandfather? He is considered the pioneer of modern marketing and one of the founders of managerial accounting. Today, the AICPA honors him.",
    "content": "The AICPA announced a new GenAI solution for its publications. The name, \"Josi\", honors Josiah Wedgwood.\n\nYou've heard of Wedgewood China? \n\n\"Josi was named after cost-accounting pioneer Josiah Wedgwood, an 18th-century English pottery manufacturer who created an early version of cost accounting during an economic slump to identify cost efficiencies.\"\n\n[https://www.aicpa-cima.com/news/article/genai-research-tool-offers-information-and-insights-from-aicpas-professional](https://www.aicpa-cima.com/news/article/genai-research-tool-offers-information-and-insights-from-aicpas-professional)",
    "url": "https://www.reddit.com/r/Accounting/comments/1ohq4yx/what_does_ai_have_to_do_with_josiah_wedgwood/",
    "score": 0,
    "num_comments": 0,
    "created_at": "2025-10-27 20:49:52+00:00",
    "permalink": "https://reddit.com/r/Accounting/comments/1ohq4yx/what_does_ai_have_to_do_with_josiah_wedgwood/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1odk2eh",
    "source": "reddit",
    "subreddit": "stopdrinking",
    "author": "SecretHurry3923",
    "title": "6 and a half years sober, I started drinking again. I thought I could handle it, but it's killing me. Please help.",
    "content": "I sobered up when I was 30. Well that's a lie, I sobered up 4 days before I turned 31, waking up in the dogs bed with an empty bottle of wine beside me, the usual story. \n\nI sobered up because this little voice in my head told me I should, so I did. \n\nSix and a half years of sobriety, but it wasn't easy. \n\nThat's not important. \n\nMy father died, I lost my family, I stayed sober. \n\nBut here's the thing, that same little voice in my head, a month after my father died, said drink, you've done enough.\n\nI told that same voice to leave me alone, I stayed sober, I won't drink to commiserate. \n\nBut life, by the grace of gods, got better, and I listened to that voice. \n\nThe same one that said sober up, said drink, so I had a glass of wine. \n\nI thought I'd be able to handle it, after six and a half years without alcohol, I thought that glass of wine would make me tipsy, but it didn't do anything. \n\nSo a week later I had 2 or 3 glasses of wine. Still nothing. Gosh, this is easy, I said to myself, I'm now doing well in life, I have a good job, I have sorted out my emotional issues, I'm exactly where I always dreamt of being. \n\nBut my goodness, when they say a slippery slope, it should have been obvious, but it's made of butter. \n\nFast forward a couple years, and my new boss is an alcoholic, I didn't predict that. \n\nWe started drinking together, we had fun, I broke up with my last girlfriend (who was tee total), for favour of a new one (who doesn't drink but doesn't care if I do, whereas the last one would have thrown me out).\n\nI got an adhd diagnosis and thought drinking was part of finding my true self, and followed that pursuit for a while, so tired of apologising. \n\nBut alcohol, and the reprieve it brings, is killing me. I keep trying to sober up again, and I just cant do it. \n\nI went on a marketing exhibition travel show and almost missed my bus because I couldn't stop drinking at the bar. My boss had to drag me out of my hotel room or I would have missed the bus, and I feel so embarrassed.\n\nAnd more to the point, I just can't seem to stop.\n\nThe voice in my head that told me to stop in the first place has gone quiet, and I know my alcoholism is affecting my poor wife (we got married earlier this year)\n\nMy father drank himself to death, and I know I need to stop, but I can't seem to find the strength to sober up again.\n\nI keep trying, and I keep ending in failure after a week or two. \n\nIf I may be personal, I think it's because my father was all the family I had in the world, and when he drank himself to death, I just didn't understand why his suitcase rattled with bottles when I thought he'd be my sober buddy during those six and a half years. \n\nYou have to have someone to see you, does that make sense? \n\nBut I also know that is just an excuse. \n\nWhat I'm trying to say, is that I went 6 and a half years sober, and now my father is gone, I can't seem to make it more than a month for some reason. \n\nAlcohol is killing me, and I want it to stop, but I can't seem to find a reason why anymore. \n\nEvery time I try, I end up with my head down the toilet. \n\nI wish I had never had that stupid glass of wine....\n\nEdit: thank you for everyone who took the time to leave a comment, it's truly appreciated. This is a wonderful community, one that I relied heavily on in the past, and hope to do so again. \n\nAlcohol is so often a symptom of a root issue, and, as some have suggested, I shall turn to my wife, my new family, to create a sober bastion of peace in this chaotic world.\n\nWhen I have kids, I don't want them growing up with an alcoholic father like I did. That alone will be incentive enough to persevere, and valuable lessons have been learnt from this relapse. \n\nI will not drink with you today. \n\n",
    "url": "https://www.reddit.com/r/stopdrinking/comments/1odk2eh/6_and_a_half_years_sober_i_started_drinking_again/",
    "score": 871,
    "num_comments": 114,
    "created_at": "2025-10-22 20:47:37+00:00",
    "permalink": "https://reddit.com/r/stopdrinking/comments/1odk2eh/6_and_a_half_years_sober_i_started_drinking_again/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1og5sl0",
    "source": "reddit",
    "subreddit": "iPhone15Pro",
    "author": "ombeombe",
    "title": "Today I found out that my 15PM is blacklisted 🥀",
    "content": "I trade phones on Marketplace just to try them as a hobby. A month ago I traded my S24 Ultra for this 15PM, mainly because I never had an iPhone before and because it looked like a good deal to me (the 15PM costs a little bit more than the S24U in the second hand market). The guy that gave me the 15PM told me that this iphone was factory unlocked and that it also was the ESIM only version. I got my ESIM in it and guess what? Everything worked flawlessly. Zero problems with my carrier, using mobile data or making phone calls. No iCloud block or anything. My guess is that this blacklist thing only works in the U.S/Canada and some other countries, but not in Latin America (where I live).\n\nToday I got an offer of someone that wanted to trade his S25 Ultra + 80$ from my end. The only thing he asked was if it was blacklisted via IMEI... That's when I checked and found out that it was indeed blacklisted. This isn't a problem as of now, because I'm not from the US, but I guess it makes this phone unusable with US Carriers. Of course this was a mistske on my end because at the moment of the trade, I never checked the IMEI status, but that was because my ESIM/carrier was working without any problems, so I assumed that it was clean. Now I guess that I have two choices, keep this iPhone and live with it till I change to a new phone in a couple years or trade it to someone that doesn't has a problem with the phone being blacklisted. ",
    "url": "https://i.redd.it/q7jd8fk4ecxf1.jpeg",
    "score": 896,
    "num_comments": 104,
    "created_at": "2025-10-25 23:27:20+00:00",
    "permalink": "https://reddit.com/r/iPhone15Pro/comments/1og5sl0/today_i_found_out_that_my_15pm_is_blacklisted/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1of4e59",
    "source": "reddit",
    "subreddit": "BattlefieldPortal",
    "author": "FoundationBig9701",
    "title": "F EA F PORTAL AND F SWEATY 7/24 LOBBIES",
    "content": "# EA/DICE: “All Multiplayer experiences, as well as Verified Community Experiences in Portal, grant full XP…”\n\n🟢 *That was the promise.*\n\n# EA/DICE Today:\n\n🔴 *“PvE options are still available through Custom Experiences, but Verified Experiences with full XP are starting to better reflect our focus on player-versus-player gameplay.”*\n\n\n\nSo basically… they advertised **full XP across all multiplayer and verified Portal servers**, sold the game on that promise and a week later, they’re quietly walking it back.\n\nI didn’t buy Battlefield to sweat in the same 3 PvP lobbies with people playing it like it’s a full-time job. I bought it for the *freedom* to play PvP **or** chill in semi-PvE modes made by the community, with real progression and unlocks. That’s what Portal was supposed to be.\n\nNow they’ve cut XP, removed popular community maps like **Shipment**, and killed the one part of the game that actually *felt alive.*\n\nIf your “solution” to XP farming is to strangle the whole mode, you’re not fixing anything  you’re punishing the entire playerbase for what a few exploiters did.\n\nDICE, **you can’t market a feature, remove it after launch, and call it “healthy matchmaking.”** That’s false advertising, plain and simple.\n\nUntil this gets fixed, I’m done defending Battlefield.",
    "url": "https://www.reddit.com/r/BattlefieldPortal/comments/1of4e59/f_ea_f_portal_and_f_sweaty_724_lobbies/",
    "score": 425,
    "num_comments": 206,
    "created_at": "2025-10-24 17:46:12+00:00",
    "permalink": "https://reddit.com/r/BattlefieldPortal/comments/1of4e59/f_ea_f_portal_and_f_sweaty_724_lobbies/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ogwkyd",
    "source": "reddit",
    "subreddit": "Money",
    "author": "Neskwiik",
    "title": "Is “VOO and chill” still the best move when 33% of the S&P 500 is just 7 companies?",
    "content": "I keep seeing “VOO and chill” or “just buy the S&P 500 and forget about it,” which made sense for a long time. But lately, I’ve been questioning how much diversification it really gives you anymore.\n\nRight now, roughly a third of the entire S&P 500’s weight comes from just *seven* companies — Apple, Microsoft, Nvidia, Amazon, Meta, Alphabet, and Tesla. Historically, it’s never been this top-heavy. Even during the dot-com bubble, the top names didn’t make up this big of a share.\n\nThat means when you buy VOO (or SPY, IVV, etc.), you’re not really getting a balanced mix of 500 companies — you’re mostly getting a tech-heavy bet on a handful of mega-caps. If those companies stumble, your “diversified” index fund takes a big hit with them.\n\nI’m not saying dump VOO — it’s still a great, low-cost, broad-market fund — but it’s worth acknowledging that the S&P 500 today isn’t the same diversified index it used to be. Maybe a more equal-weighted ETF like RSP or adding some international or small-cap exposure makes sense to smooth things out.\n\nCurious what others think — is “VOO and chill” still good advice, or has the market concentration changed the game?",
    "url": "https://www.reddit.com/r/Money/comments/1ogwkyd/is_voo_and_chill_still_the_best_move_when_33_of/",
    "score": 365,
    "num_comments": 238,
    "created_at": "2025-10-26 21:31:08+00:00",
    "permalink": "https://reddit.com/r/Money/comments/1ogwkyd/is_voo_and_chill_still_the_best_move_when_33_of/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ogqij0",
    "source": "reddit",
    "subreddit": "hottoys",
    "author": "blue2755",
    "title": "The State of Collecting: HK Resellers and The Influencer",
    "content": "Scammers, Deals, Fast Shipping, Stole my money!\n\nFor the past 5 years the communities out look on the Hong Kong Reseller market has shifted in all directions. For many veteran collectors, we know who to look out for, but for new collectors the first place they put their trust in is the influencers. It’s quick for us to point blame since we know better, resources already are in place as red flags, yet remain missed due to human psychology. I want to take a true deep dive not only for veterans but the shines among us. Below I’ll detail a brief history of the HK Reseller scene, current big names, Toys Wonderland, influencer marketing, FOMO Culture, What is the “Scam,” and lastly Personal Responsibility. \n\n\nHow did this even begin? To really understand the early rise of what we call the “HK Reseller” we have to look back to the roots of the business. Sideshows (U.S based) partnership with Hot Toys (China/HK based) goes back for decades. As of the writing of this article, Sideshow, is the current holder of the global distribution rights for all things Hot Toys. For many Sideshow is the only source for acquiring Hot Toys legitimately, although many alternatives do exist, Sideshow often is their supplier as well. Now that you have the context of Sideshow, we take a look at the rise of the HK Reseller. Early on, many of the most well known resellers began on a marketplace we’re all familiar with eBay. Some of the largest “influencer” YouTubers in the early days were the likes of Budget Stark, Shartimusprime, and Danoby2. (For fact checking purposes if you have alternative names please dispute in the comments below) These early influencers were producing content centered around Hot Toys with a larger audience. In the case of Budget Stark (based in HK) he would often be the supplier for other Hot Toys reviewers as he had access to day one supplies. This early access to Hot Toys figures laid the building blocks for what’s to come.  Some of the oldest resellers that remain in business are the likes of the ToyBuyingAgent and OneSixthKit. Who both ran, eBay stores alongside their own websites. Another early reseller was the infamous Toys Wonderland. TW started out as an eBay seller, grew a large following and built a reputation of trust, along with a young Australian YouTuber who would later become their closest business partner, Justin’s Collection. HK Resellers at this early point where known as the alternative on global stage to access Hot Toys figures early and for some were the better deal alternative. To understand why, we have to look at taxes, tariffs/import fees, and shipping. For our European collectors for example, if you order from Sideshow, first you’d wait for the HK release of a figure, a month or two later it would arrive in the states at Sideshow, who would then send it out to their customers and retail partners, then after which they’d send it out internationally. Now sideshow would pay the import fees from China, then once shipped out to EU customers you’d deal with any additional import fees and taxes on the goods. For many these extra fees and up charges made this hobby limited or unattainable. Until the HK resellers became the alternative, through shady practices allowing for new ways to bypass import and taxes they undercut international companies like Sideshow, as well as local comic book shops. To dive into this practice we go to arguably the fallen king of this strategy, Toys wonderland. \n\n\nThe Toys Wonderland Story(Phillip Lu)\n\nFor a proper deep dive into the complicated history and mess of TW would require its own article. So here we will briefly do an overview of the situation. Starting off like many HK Resellers through an eBay store. TW was run by Phillip Lu “the toy wizard” as Justin would call him, and there remains a connection we must first explore in order to understand Toys Wonderland. A young Aussie who began his early reviews unpolished but full of excitement to reach the heights of his ideals like Budget Stark. Justin’s early YouTube career sought out early releases through these eBay listing from HK, who he would partner with a number of sellers to get supplies early. One such seller for a time was Eric Lee Toys. Who Justin cultivated a partnership through both YouTube and Facebook. Justin’s frequent trips to Hong Kong would later introduce him to Phillip Lu and thus a partnership would be born that would give rise to Toys wonderland. (Editors note, I’m glossing over a lot of information and the timeline history is a bit wanky here so please as the man says himself “do your own research”)  sometime around 2019 Justin would form a partnership with Phillip that would turn Toys wonderland into his sole supplier, the inner workings of the contract haven’t been showcased so we have to go by Justins word which he claims “sometimes I’d get free figures, other times discounted.” Phillip wanted to grow toys wonderland into the go to site for all things collecting, from Hot Toys to statues, third parties and more. Justin became the face and spokesperson for the brand, while Phillip ran the background business dealings. (Toys wonderland would later branch off its third party half into its own website and after the fall out change into Toys Apollo) to understand the influence Justin had on TW, his name/channel was featured promptly on the homepage, his photos were used as the promotional material for listings, and his reviews directly linked to the website. Justin and toys wonderland were one and the same for a great stretch of time, so what happened? During the Covid lock downs and supply chain bottle necks at ports globally, suppliers such as Sideshow couldn’t get their stock without months of delay. This would become the catalyst for the rise of the HK resellers, and with Justin’s collection growing to become the most popular 1/6th YouTuber at the time, so to did toys wonderlands appeal. Justin marketed them as the go to place to get your figures earlier than sideshow by multiple months. Which he was correct, for example Captain America endgame released early in 2021, and sideshow wouldn’t start shipping until nearly late September of that year, so as collectors watched YouTubers get  very desirable figures early on while we waited for months, the appeal of the HK resellers grew. I’d like to continue this discussion on TW at another time, but to conclude with what lead to their fall. TW began over promising and under delivering. Because they had these figures early, and due to the bottlenecking of official suppliers, TW which used to be a site to go for deals on releases, became a price gauging site who would mark up releases, while offering a “deal option” through full payment pre order deposits. The issue was when collectors pre ordered these releases they weren’t receiving what they ordered. I’ll take a deeper dive into the “scam” further on in the article. This growing distrust would lead to the death of toys wonderland, a fractured relationship between Justin and the greater community and the rise of their competitor, the newly infamous Popcollectibles. \n\nThe Current Big Names\n\nOneSixthKit, Popcollectibles, ToysBuyingAgent, TNSfigures, Giantoys, and Toys Assembled are just a few of the big name HK resellers still in the game. These sellers all have various levels of trust within the community and I hope to do my best to break them down with as little bias as I have, so take this section as mostly opinionated. To start off, OneSixthKit. Otherwise known as simply Kit, began his career on eBay and later built the website store as we know it today. Kit is currently regarded as one of the oldest and most trustworthy HK Resellers on the market (I’ve personally order a large number of things from Kit without issue) alongside ToysBuyingAgent, who also began their career on eBay. TNSfigures is another, lesser known seller who also runs an actual store within HK, I have not personally ordered from them in years, but they always delivered the 3 figures I ordered. Giantoys is another, I have personally had nothing but amazing experiences with them, and one time due to a shipping error on their part which delayed a figure of mine for a month, they ended up getting the figure to me and also offered a discount code as compensation for the extend wait. (I have not ordered from them in a long while either as I stopped collecting third party figures so I have no current experience) Toys Assembled, I’ve had genuinely the best experience with them (second to Kit) as they’ve always honored their 3 day shipping, and their communication being only second to kit. Their prices vary in terms of “deals” but if you want something fast (3 days) you’ll get it. Lastly, Popcollectibles, I’ve never placed a single order with them, although have been tempted in the past, I cannot give a personal opinion on, but given the community’s current outlook and the constant sellout culture of the “influencers” all rushing to promote them, I cannot in good faith ever endorse or recommend this shop in anyway. Yet, there remains the core problem, recommendation, otherwise known as, The Influencer” \n\n\n\nInfluencer Marketing \n\n“I got mine at…” with the birth of YouTube and rise of social media, we’ve seen the rise and fall of many different types of what is referred to as “The Influencer” or simply the content creator. When people search for reviews of a product or just want to receive more information to better their purchasing decisions they open themselves up to being influenced. Many of us can claim to be immune but human physiology is a tricky thing. For our younger collectors starting out into this hobby they might have come across these figures through YouTube/shorts, TikTok, or Instagram to name a few.  They come across a video by Justin while looking up a marvel deep dive, or scrolling past a toy photography posing session with the likes of Zordphotography, or while doomscrolling they come across Kazuma. (I mention these 3 in particular given their influence on this sub specifically and their affiliation with Popcollectibles) Unknown to the bright eyed collector, they see these figures and are captivated by them, and given the more relaxed (yet over the top) nature of someone like Kazuma, or the arguably very talented posing of Zord, or the presentation of Justin they get a sense of FOMO or impatience as sideshow won’t ship for another month, meanwhile these sellouts (yeah I said it and I stand by it), are getting figures early, so why not spend a little extra to do the same? Why not chase the next high with them? This I’ll explore in the final section, but for now, collectors need to understand that when you go looking for more information on a product you will expose yourself to creators who’s sole motivation is making a quick buck at your expense while also getting access to figures they have a passion for. You aren’t a fool for feeling FOMO, you aren’t an idiot for trusting these sellers, and you aren’t stupid for wanting a figure early. But you must hold yourself accountable for when, where, and who you spend your money with, so the next time you watch a video, appreciate a pose, or doom scroll, keep in mind these creators are paid advertisers regardless if they want to admit it or not. \n\n\nWhat is FOMO?\n\n“Don’t miss out, pre order now!” FOMO or the “Fear of Missing Out” is a term you’ll see used across the sub and other hobbies that primarily revolves around the psychology of being left out or left behind by the group. We as humans are social creatures, throughout history we survived by working together, and to be the outsider often meant death. In the modern world we don’t see the FOMO the same as our ancestors but the fear is ingrained in our DNA, the desire to be included or be part of a social group can create an atmosphere of chasing after the next high.  This is where personal responsibility comes into play, but for a moment I want to discuss how marketing can hijack the logical parts of our brain. When emotion takes over, the human mind can be easily manipulated, and when dealing with products or topics that people have an enormous passion for, this is where the influence can begin, after all Hot Toys themselves does it by taking a character we all love and turning them into a product. Now FOMO comes in quick if you’re a new collector or hell even a veteran, when you see videos or posts showcasing the latest release you fear you’re missing out on the hype. Take for example this sub, when a new figure drops you’ll see activity on posts skyrocket for what’s new, but then couple months go by and collectors finally get theirs in hand and then the feedback and love isn’t there, it moved onto the next thing. For some it can kill the joy of the hobby if all you chase is the next high and you’re always late to the game. Thus “I got mine at Popcollectibles” becomes the new “I got mine at Toys wonderland” and people continue to fall for the con. But what is the con? Will get there in a moment, but I want to conclude something first. Influencers aren’t always the “bad guys” I know I gripped on them earlier, but the truth is they do provide a service by showcasing something early and giving us on the fence a chance to really see a product before we make the purchasing decision. The problem arrives when they promote a seller that doesn’t have the best interest of the consumer. A lot of these content creators are passionate individuals with love for the hobby who get caught up in the excitement of receiving desirable figures early and growing their own individual business, a classic “scratch my back I’ll scratch yours.” But often, they sacrifice something every artist does when they sell their soul to the highest bidder, themselves, and who they were before they became “the FOMO influencer”\n\n\n“I GOT SCAMMED” \n\nAlright, I’ve delayed it long enough, what is the scam? What’s the con? In short to understand the con I bring you back to the beginning, earlier on I talked about the rise of the HK reseller and the birth of the partnership between content creators and resellers. Originally the purpose behind the resellers is the same as any business, make money. They all started off by buying the product in HK directly for retail, then selling it for a profit to the rest of us. Often times even cheaper than sideshow because it’s cheaper in Hong Kong. If they purchase a figure for $150, that Sideshow sells for $300 they can sell it for $250 and not only make a profit but offer a “deal” to the collector. That was the appeal of these resellers. But everything changed when COVID attacked (yeah I did a ATLAB) when the bottle necks came in and halted progress for official distributors, it opened the door for the resellers to take advantage. Here’s the situation, you were previously selling figures for a decent profit, by undercutting the competition, but now the competition can’t even get the products within a reasonable time, so you have this unsatisfied demand that’s growing, and you have access to the very products to satisfy that demand. So why not fulfill that demand but make even more money. Yeah Sideshow is selling it for $300 and you’re selling it for $400 but you are delivering it 8 months sooner, suddenly that premium price feels worth it for some collectors because FOMO. So here you are building up these pipelines of overcharging the collector, the influencers are doing the marketing for you because they’re happy to get a figure early while also giving their channels an edge by uploading before anyone else could. Yet to maintain the idea of trust you offer the “pre order option” which for many of these sites and sellers is how the customer can secure these figures earlier than Sideshow but also cheaper than the day one premium up charge. For a time this works, and it worked a little too well, so much so that it created mass cancelations for Sideshow and left them with so much overproduced stock that it’s still up for sale to this day. Toys Wonderland and the HK resellers alongside the bottle neck delays created a perfect storm. Collectors had extra income through the stimulus payments, they then pre order through Sideshow, delays kick in, collectors get FOMO, cancel, and then buy from TW, who then begins to order more in HK thus the HK supply starts growing this new demand. Hot Toys sees it as more business in HK, but the truth is this is the same pool of collectors that Sideshow sells to that are just being double fished by TW. So what happens when you have one side placing an order for 100 and the other side places the same order, and the truth is there’s only demand for 100? That’s right you get stuck with 100 extra figures that no demand exists for. Hence why we have smaller batches today and things waitlist so easily. This con worked for a time, that was until the bottle neck cleared. All of a sudden the time between Sideshow receiving an order and the HK release shortens, and at one point for a select number of figures it was same day for both. Now collectors felt like they got scammed by the HK sellers, “why am I overpaying when you no longer have the advantage of getting it early?” But here’s the thing, the influencers kept these business alive, the trust their communities had was still strong. So you continue the business model the issue now is, you’ve got an order for 100 units, 50 of them are day one premium (overcharging) pre orders, the other 50 are “second batch” pre orders (cheaper priced) the con becomes this. The figure release in Hong Kong, you satisfy the first 50, you have the other 50 you ordered, but you aren’t shipping it out because you want to milk the people that didn’t pre order day one but still want the figure and are willing to pay the extra premium. So you start selling your extra 50 that is meant for the people that ordered it at that $250 price, instead at the $400 price the first 50 payed. Now a month or two has gone by, the people you scammed are angry they still haven’t gotten theirs, and now Sideshow is starting to ship so it looks worse on you, so now you ask for more money or delay and ignore as long as you can, or worse, these collectors paid in full a year earlier (like in the case of toys wonderland) so they can’t do a charge back, so you don’t even have to worry about actually shipping anything because you’ve gotten their money and you can sell it at that higher premium. How did they get away with this for so long? Because of the sideshow delay, given the bottle neck the collectors that pre ordered for the cheaper price waited until the HK reseller had milked the supply as much as they could before finely accepting they needed to ship out to the other 50. The catch was sideshow was still 3 months out due to the delays so you still were delivering earlier, and you live in HK so all you have to do is go to the Hot Toys store and buy some extra supply at the cheaper price and sell it at the $250 you promised. The problem became Hot Toys stopped making as much extra as they did because Sideshow stopped ordering so much, so the extra supply these HK sellers were using to offset the negative pre orders they had because they sold the stock you ordered to another person at the higher premium price, no longer was available for your order. Hence why they never shipped your order because the consequences weren’t there since you couldn’t charge back. This is why you and every other collector got and still keep getting scammed. If you pre order from these HK resellers at full price deposits, you are asking for them to scam you. So when does personally responsibility come in?\n\n\nResponsibility And Who’s To Blame?\n\nI spoke about personal responsibility throughout this article, and frankly the people that need to hear this part didn’t make it past the first paragraph or let alone click on the article. So for those that did, hopefully you can be the change for the better. We as collectors have to hold ourselves accountable, I include myself into this as I too have been a part of this problem by purchasing from HK resellers and paying that premium. Now, I don’t want this part to be taken as no one should ever pre order from Hong Kong Resellers, I still do, and there’s a few that I trust. But when and how to pre order is the part you need to focus on. I for example have never and will never do a full payment deposit for a figure from an HK reseller, because that’s me putting blind faith and trust that they’ll honor their word. I cannot in good faith do that kind of business with a website or seller that sells third party unlicensed goods because they are already going against the law, so what makes you think they’ll care about you? The only places I can ever vouch for you to place a pre order at, is ones with the history, and reputation of consistency, but most of all places that allow you to do a basic deposit similar to sideshow. A $30-$50 deposit on a figure that costs $300 is an easier pill to swallow if you get scammed because you only lost $30, and it’s a greater incentive for the reseller because they are taking all the risk because in HK they have to do a 50% deposit on the order, so they have to deliver to you in order to get the rest of the money. If you blindly were paying these sellers full deposits a year or two in advance going off the trust of a YouTuber or “Infuelncer” than you need to understand you’re as much at fault as they are. FOMO plays a part, human psychology through marketing plays a part, Infuelncer promoting plays a part, but you are the one that paid for it. You need to understand regardless if it’s toys, or other things “do your own research before buying.”  There’s so much more I’ve left unsaid as this is already far too long of an article for most people’s attention. But for the few that do, I hope it genuinely gets across the importance of using extra caution when ordering, and that it’s okay to miss out on something. \n\nSo the next time you see an Aussie with a white background showcasing a figure, or a red beared dude with good lighting, or an annoying ass tiktoker, or a dude with great lighting, posing and composition showing off a figure, you’ll think twice before clicking the link, down in the description below. \n",
    "url": "https://i.redd.it/uujzoem9rhxf1.jpeg",
    "score": 219,
    "num_comments": 253,
    "created_at": "2025-10-26 17:29:53+00:00",
    "permalink": "https://reddit.com/r/hottoys/comments/1ogqij0/the_state_of_collecting_hk_resellers_and_the/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ode7c8",
    "source": "reddit",
    "subreddit": "americangirl",
    "author": "prettyminotaur",
    "title": "Hot Take: Mattel doesn't understand the adult collector market",
    "content": "I've recently gotten back into trying to assemble/collect Kirsten's collection through ebay purchases, etc. And as I'm searching, it occurs to me that Mattel seems completely out of touch with what the adult collector market wants to see. I've noticed this in the Barbie fandom, too. But over in AG land, Mattel's cluelessness manifests as follows:\n\n1. I don't understand why on Earth they discontinued the OG historical girls' lines, as these items are the most coveted among adult collectors, especially now as elder millennials (hello, I'm 45) like myself want to collect the pieces they missed as children. Mattel makes nothing from the secondary market--they'd make BANK if they made more repro PC stuff for Kirsten, Samantha, Molly, Addy, Felicity, Josefina, like the recent school outfit rereleases. These are the girls my generation has the most nostalgia for, and there are thousands of us out here who want to buy ourselves the items we didn't get when we were kids. Why make us go to the secondary market when Mattel could practically print money?\n\n2. Maybe it's just me, but the overwhelming prevalence of cheap pink/purple plastic crap in the AG lines since the Mattel takeover just makes anything new they put out extremely off-putting to me.\n\n3. As an adult collector, I might have been interested in Courtney, as she's from \"my era,\" but they chose to dress her the way teens today THINK we all dressed in the 1980s, instead of looking at the actual fashions 9 year olds wore back then. There's nothing nostalgic about her collection for me EXCEPT her Strawberry Shortcake sleeping bag, which is identical to the one I owned in 1984. It's giving \"pastiche\" more than authentic historical reproduction. And don't get me started on the 1990s twins, who dress like teenagers, not nine year olds. I suspect this is because Mattel/AG has now reached historical periods where corporate licensing becomes essential to create \"accuracy,\" versus the unbranded stuff of the 19th/early 20th century. Corporate licenses are expensive. \n\nThank you for coming to my Ted Talk.",
    "url": "https://www.reddit.com/r/americangirl/comments/1ode7c8/hot_take_mattel_doesnt_understand_the_adult/",
    "score": 397,
    "num_comments": 157,
    "created_at": "2025-10-22 17:09:49+00:00",
    "permalink": "https://reddit.com/r/americangirl/comments/1ode7c8/hot_take_mattel_doesnt_understand_the_adult/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1odaews",
    "source": "reddit",
    "subreddit": "10xPennyStocks",
    "author": "Aashir_J",
    "title": "let me be very clear about these HALTS, for the newbies.",
    "content": "A HALT IS NOT A BAD THING !!!\n\nIt just means that the stocks volatility is off the charts. The exchange literally has to pause trading because orders are flying so fast that market makers can’t keep up... and yeah, that means they’re nervous.\n\nSo if BYND was halted three times in under half an hour, it means retail and algos were blasting through bids/asks nonstop, pure squeeze volatility. Shorts trying to cover, momentum traders piling in, brokers scrambling to find liquidity.\n\nPeople try to panic sell and it then goes down, shorts recover, and we lose.\n\nThe key is keeping a level head and understanding what’s happening, and that it isnt bad.\n\nGME and AMC were halted multiple times in 2021. The only ones who won there, and win here? are the ones who don’t flinch.\n\nEvery halt is just a sign that the system is trying to slow down what it can’t control. Get ready to get halted multiple times today.\n\nBeing part of history isnt a smooth sail. BYND isn’t done yet, neither are we.",
    "url": "https://www.reddit.com/r/10xPennyStocks/comments/1odaews/let_me_be_very_clear_about_these_halts_for_the/",
    "score": 630,
    "num_comments": 103,
    "created_at": "2025-10-22 14:51:15+00:00",
    "permalink": "https://reddit.com/r/10xPennyStocks/comments/1odaews/let_me_be_very_clear_about_these_halts_for_the/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oeu4mt",
    "source": "reddit",
    "subreddit": "10xPennyStocks",
    "author": "Nextiq",
    "title": "FYI",
    "content": "",
    "url": "https://i.redd.it/1jty9g7ae1xf1.png",
    "score": 529,
    "num_comments": 96,
    "created_at": "2025-10-24 10:28:40+00:00",
    "permalink": "https://reddit.com/r/10xPennyStocks/comments/1oeu4mt/fyi/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1odmpey",
    "source": "reddit",
    "subreddit": "ValueInvesting",
    "author": "kfcman456",
    "title": "The Big Short of AI",
    "content": "During the housing market crash, people like Micheal Burry studies the tranches, mortgages, made credit default swaps, and timed the market. \n\nWhat’s going to be today’s equivalent when this AI bubble pops?",
    "url": "https://www.reddit.com/r/ValueInvesting/comments/1odmpey/the_big_short_of_ai/",
    "score": 147,
    "num_comments": 242,
    "created_at": "2025-10-22 22:34:50+00:00",
    "permalink": "https://reddit.com/r/ValueInvesting/comments/1odmpey/the_big_short_of_ai/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oet6to",
    "source": "reddit",
    "subreddit": "10xPennyStocks",
    "author": "Excellent-Jaguar9118",
    "title": "The final war is coming",
    "content": "https://preview.redd.it/co1dfutq31xf1.jpg?width=4000&format=pjpg&auto=webp&s=902bc39eff5e406312a2ed86603031f17512cdb7\n\n",
    "url": "https://www.reddit.com/r/10xPennyStocks/comments/1oet6to/the_final_war_is_coming/",
    "score": 668,
    "num_comments": 74,
    "created_at": "2025-10-24 09:29:55+00:00",
    "permalink": "https://reddit.com/r/10xPennyStocks/comments/1oet6to/the_final_war_is_coming/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oi6qb2",
    "source": "reddit",
    "subreddit": "DaveRamsey",
    "author": "Thick_Natural3171",
    "title": "My spouse is still not completely on board with living debt free life and says they want to “enjoy the years they have left”. How would you respond?",
    "content": "I am 37, mg husband is 46. Almost 10 years older than me. We come from completely different backgrounds. My parents are wealthy, self made millionaires who started with very little and sacrificed and worked hard to stay out of debt and become successful.  Mirroring this model, I too worked hard to stay out of debt and have significant savings (200k) despite having a progressive disability all of my life . I made sacrifices at times (renting rooms in houses and buying beater cars) to accomplish what I have. My husband grew up with poor parents who taught him little about being financially responsible. They congratulated him on buying cars with car loans, encouraged student loan debt, and continuously tell him to just “rest and not work so hard” when he complains his finances are not where he wants them to be. Because of this, my husband perhaps didn’t make as much sacrifices that I made to set himself up later in life . Because of this and also buying a house he could not afford at one point, he doesn’t have much in terms of savings. He’s always lived comfortably because he’s always either had credit cards or didn’t prioritize having savings. \n\nI can no longer work a 9-5 job with my disability and my future is uncertain with my health issues. When me and my husband got married two years ago we agreed that my savings would be reserved for my ongoing medical conditions and my future since I don’t have a pension like him and will need those savings. I don’t believe in commingling my savings in my situation since i am in a complex position. Meaning that I will need the money later, my husband doesn’t have a history of being as financially responsible as me, divorce stats aren’t good for disabled folks, and without this money I would be forced to be reliant on my spouse so that I would never be able to leave an abusive /bad situation if it should arise. I don’t really want to hear criticism from people about this part about how this is anti Dave Ramsey because I’ve personally heard Dave Ramsey advise people to protect themselves in complex cases or in marriages where it seems like the other spouse may not be on the same page. \n\nDespite my significant health issues I wanted to create a better life for me and my husband so that we could get on the same page as far as having savings and setting ourselves up for  a great retirement. I explained to my husband that even with his pension, it will not be adjusted for inflation so he could be living in poverty 15 years after retiring. I tried to find some sort of work I could do, and started an an e-commerce business because it’s something I can do from home for the most part. I do need my husbands help to go to events on weekends for 3 months out of the year. The events drive online sales but the most memory we bring in is from shows. . I do the marketing myself, manufacturing of goods, recording inventory, talking to supply chains and ordering inventory, budgeting, networking, planning events, designing website, packaging and sending out orders, all while cooking and cleaning and maintaining a home. I gotta say I am getting tired, and I push through severe pain everyday to try to secure a better future for us. For our second year in business, I have made 70k in sales and am projected to make 100k before the year is over. I am pretty proud of this accomplishment and see the business as a success. \n\nWhen I first started the business my husband said things like “if this business takes off and your making a million a year I’ll totally quit my 9-5 job and work with you”. I kind of rolled my eyes, because to make a million would take significant time. It was nice to be encouraged though and I appreciated that. I took out 40k of my own personal savings to start this business thinking I had his full support in it and dedication to building a life debt free. I have taken money out of the profits to pay down 30k that my  husband owed in credit card debt . My husband said that we should reward ourselves at the end of this year and buy a hot tub. I certainly want to reward myself , but when I saw that a decent one that won’t break will cost 10k I said we have to reinvest this money back into our business. My husband complains about being burnt out and is upset I think that we perhaps aren’t using the money to fund fun things. \n\nHe didn’t seem to understand that a business doesn’t have 100% profit and even if we make 100k we only have a 50% profit margin (which by the way is incredible for this particular industry). He is seemingly upset that I told him that the 30k we have saved this year needs to be reinvested back into the business to buy machinery so that I can scale the business more next year. He wants to buy things and wants to have retirement savings, like now. I explain that nothing is without sacrifice. And if you didn’t sacrifice in your 20s, you will have to start now to have a great future. He said to me last night he doesn’t think the business will be as successful as I think and asked me how many years of us working are we going to make enough to have a good retirement . He said he doesn’t think it’s worth it and that at his age he wants to enjoy life , he wants to buy a house and I haven’t been on board, and he’s tired of living this life that I think is best if he’s just going to die in 20 or so years. We have a condo now and no down payment for a house besides using the sale of the existing condo) so we would be house poor with a 7% mortgage if we bought a house and I am concerned that if we did buy a house that if anything goes wrong with it that my husband would ask me to use my money from my medical savings to pay for it . \n\nHe ended the conversation with saying he would rather live the rest of the years he has left by being in debt and at least getting to go on vacations, have a house , and enjoying life like he sees others do around him. He said he doesn’t want to work until he’s 70, just to die without even having gone on a nice vacation and enjoy life a little. He told me that I have to accept that we aren’t going to live a life like my wealthy parents do. I don’t think people have to be extremely wealthy to not be in debt, but I do understand that in today’s age to be out of debt can sometimes mean that people aren’t doing fun things like vacations and buying nice things .  \n\nHe said we have to find some sort of compromise about this idea about not living in debt. He said that he doesn’t know anyone now who doesn’t have some sort of credit card debt but they have children and they go on vacations and enjoy life . I am wondering if anyone else has faced similar situations with their spouse . In my situation I am probably going to live a lot longer than my husband and have significant medical costs. While I would love to buy hot tubs for us, go on vacations, I’m also realistic and know that I will need to pay for the upkeep of our home and will need money to live on when my husband is no longer around and if we just spend frivolously now I will be the one to pay the price . I think that both spouses should be on board to prevent future destitution, and I feel that in my situation my spouse should be planning for a life when he’s no longer around and worrying how I will survive. It is concerning to me that he doesn’t seem to take that into consideration, or at least that is how it sounds. From my perspective, if we are going to make the marriage work, I have to basically be financially independent and responsible regardless of what my husband wants to do with money. I love my husband, but feel like I need to plan separately from him if we have differing views on finances and debt. ",
    "url": "https://www.reddit.com/r/DaveRamsey/comments/1oi6qb2/my_spouse_is_still_not_completely_on_board_with/",
    "score": 23,
    "num_comments": 389,
    "created_at": "2025-10-28 11:25:23+00:00",
    "permalink": "https://reddit.com/r/DaveRamsey/comments/1oi6qb2/my_spouse_is_still_not_completely_on_board_with/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1oi4s7l",
    "source": "reddit",
    "subreddit": "stocks",
    "author": "AutoModerator",
    "title": "r/Stocks Daily Discussion & Technicals Tuesday - Oct 28, 2025",
    "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help **measure the trajectory of a security.**  TA can also be used to interpret the actions of other market participants and predict their actions.\n        \nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
    "url": "https://www.reddit.com/r/stocks/comments/1oi4s7l/rstocks_daily_discussion_technicals_tuesday_oct/",
    "score": 11,
    "num_comments": 420,
    "created_at": "2025-10-28 09:30:07+00:00",
    "permalink": "https://reddit.com/r/stocks/comments/1oi4s7l/rstocks_daily_discussion_technicals_tuesday_oct/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ohzi57",
    "source": "reddit",
    "subreddit": "uberdrivers",
    "author": "SDPRINCE619",
    "title": "Took the ride you guys all swear you’d DECLINE 🤣✊🏽🤡",
    "content": "I haven’t seen anyone say a single good thing about these long-distance rides lol. No matter the fare, miles, or duration, somehow you guys always find a way to say it’s trash and how you would’ve never taken it 😂\n\nThis one popped up for me. San Diego to Calexico, $155 for about a 2-hour drive. It’s a slow Monday, I drive a Tesla, and I only spent around $15 for a full charge. One solid ride, decent pay, and I’m home early instead of chasing short trips for 6 hours just to make the same money.\n\nSo here’s a little rage bait for you guys to tear me apart and tell me I’m a slave lol. But honestly, I’ll take this any day over wasting half my night waiting for pings that barely pay.\n\nIf I get a ride back, cool. If not, still a W in my book.\n",
    "url": "https://i.redd.it/wvzb8yz2yrxf1.jpeg",
    "score": 190,
    "num_comments": 189,
    "created_at": "2025-10-28 03:45:55+00:00",
    "permalink": "https://reddit.com/r/uberdrivers/comments/1ohzi57/took_the_ride_you_guys_all_swear_youd_decline/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1ohja6x",
    "source": "reddit",
    "subreddit": "RealEstate",
    "author": "djthaimyshoes",
    "title": "Just toured a “cash only” gutted house listed for $200K+… what are these sellers thinking?",
    "content": "I went to tour a property today that really left me scratching my head.\n\nThe seller is asking a little over $200K (cash only) for a house that’s completely gutted, had a small contained fire in the furnace and bathroom area, and clearly needs a major rehab (probably $120K+ in work just to make it livable again).\n\nThe ARV is around $300K, so there’s practically no room for an investor or flipper to make the numbers work. When I walked through, parts of the home were stripped down to the studs, some smoke damage was still visible, and the flooring was soft in spots.\n\nWhat’s even more surprising is that it’s been on the market for over 340 days.\n\nI’m genuinely curious...what’s driving these kinds of listings? Are sellers just testing the market, or are agents encouraging unrealistic pricing hoping for a lucky cash buyer?\n\nWould love to hear from anyone seeing similar trends or who’s had experience negotiating on properties like this.\n\nFYI: I know some people might argue that the land value is what’s driving the high asking price and that could be true in some areas. But in this case, I really doubt it, since the property is located in a rougher neighborhood where land values haven’t appreciated much.\n\nUpdate: thanks to everyone who actually gave great insight. That is all I was asking. ",
    "url": "https://www.reddit.com/r/RealEstate/comments/1ohja6x/just_toured_a_cash_only_gutted_house_listed_for/",
    "score": 235,
    "num_comments": 166,
    "created_at": "2025-10-27 16:35:18+00:00",
    "permalink": "https://reddit.com/r/RealEstate/comments/1ohja6x/just_toured_a_cash_only_gutted_house_listed_for/",
    "workflow": "query",
    "search_query": "what's the market today"
  },
  {
    "post_id": "1of334i",
    "source": "reddit",
    "subreddit": "WWIIplanes",
    "author": "Terrible_Log3966",
    "title": "End of the flying road for this D-Day veteran.",
    "content": "Today it was announced that C-47/DC-3 PH-PBA will become part of the fixed Aviodrome static collection. Plans to keep her airworthy cannot be made financially viable according to the museum. \n\nThis airframe has had a long service history and saw action on D-Day and Market Garden among other missions. After the war she was acquired as the personal aircraft of HRH Prince Bernard van oranje (PBA stood for Prins Bernhard Alpha) and later it did service as the main Dutch government transporter.\n\nUntill recently she flew passengers on sight seeing flights all around Europe. I myself was a pax on her in Normandy skies on June 6th a few years ago. \n\nWhat a shame her flying days are over!",
    "url": "https://i.redd.it/wrnse1ifb3xf1.jpeg",
    "score": 963,
    "num_comments": 48,
    "created_at": "2025-10-24 16:56:11+00:00",
    "permalink": "https://reddit.com/r/WWIIplanes/comments/1of334i/end_of_the_flying_road_for_this_dday_veteran/",
    "workflow": "query",
    "search_query": "what's the market today"
  }
]