[
  {
    "post_id": "1oesq8x",
    "source": "reddit",
    "subreddit": "technology",
    "author": "ControlCAD",
    "title": "Guillermo del Toro compares Frankenstein to a careless \"tech bro,\" says he would \"rather die\" than use generative AI: \"My concern is not artificial intelligence, but natural stupidity\"",
    "content": "",
    "url": "https://www.gamesradar.com/entertainment/horror-movies/guillermo-del-toro-compares-frankenstein-to-a-careless-tech-bro-says-he-would-rather-die-than-use-generative-ai/",
    "score": 10236,
    "num_comments": 217,
    "created_at": "2025-10-24 08:59:43+00:00",
    "permalink": "https://reddit.com/r/technology/comments/1oesq8x/guillermo_del_toro_compares_frankenstein_to_a/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ogfxhr",
    "source": "reddit",
    "subreddit": "NeoCivilization",
    "author": "ActivityEmotional228",
    "title": "Ohio lawmakers introduced House Bill 469 to ban artificial intelligence from marrying humans or gaining legal personhood. The proposal defines AI as “non-sentient entities,” preventing systems from owning property, running businesses, or holding human rights.",
    "content": "",
    "url": "https://i.redd.it/sjqs2k0b9fxf1.png",
    "score": 187,
    "num_comments": 250,
    "created_at": "2025-10-26 09:05:40+00:00",
    "permalink": "https://reddit.com/r/NeoCivilization/comments/1ogfxhr/ohio_lawmakers_introduced_house_bill_469_to_ban/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oifza0",
    "source": "reddit",
    "subreddit": "rareinsults",
    "author": "moesyslak",
    "title": "The top comment did not disappoint",
    "content": "",
    "url": "https://i.redd.it/19lcia3n2wxf1.jpeg",
    "score": 24714,
    "num_comments": 953,
    "created_at": "2025-10-28 17:38:35+00:00",
    "permalink": "https://reddit.com/r/rareinsults/comments/1oifza0/the_top_comment_did_not_disappoint/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oev4tt",
    "source": "reddit",
    "subreddit": "singularity",
    "author": "ajarbyurns1",
    "title": "OpenAI has more than 100 ex-investment bankers helping train its artificial intelligence on how to build financial models",
    "content": "",
    "url": "https://www.bloomberg.com/news/articles/2025-10-21/openai-looks-to-replace-the-drudgery-of-junior-bankers-workload?embedded-checkout=true",
    "score": 497,
    "num_comments": 111,
    "created_at": "2025-10-24 11:25:17+00:00",
    "permalink": "https://reddit.com/r/singularity/comments/1oev4tt/openai_has_more_than_100_exinvestment_bankers/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oh08v2",
    "source": "reddit",
    "subreddit": "interestingasfuck",
    "author": "Ordinary_Fish_3046",
    "title": "A US teenager was handcuffed by armed police after an artificial intelligence system mistakenly said he was carrying a gun - when really he was holding a packet of crisps.",
    "content": "",
    "url": "https://i.redd.it/3wt9bmgdrjxf1.jpeg",
    "score": 342,
    "num_comments": 115,
    "created_at": "2025-10-27 00:14:05+00:00",
    "permalink": "https://reddit.com/r/interestingasfuck/comments/1oh08v2/a_us_teenager_was_handcuffed_by_armed_police/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ogfxy6",
    "source": "reddit",
    "subreddit": "Futurism",
    "author": "ActivityEmotional228",
    "title": "Ohio lawmakers introduced House Bill 469 to ban artificial intelligence from marrying humans or gaining legal personhood. The proposal defines AI as “non-sentient entities,” preventing systems from owning property, running businesses, or holding human rights.",
    "content": "",
    "url": "https://i.redd.it/sjqs2k0b9fxf1.png",
    "score": 341,
    "num_comments": 110,
    "created_at": "2025-10-26 09:06:28+00:00",
    "permalink": "https://reddit.com/r/Futurism/comments/1ogfxy6/ohio_lawmakers_introduced_house_bill_469_to_ban/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ogfy28",
    "source": "reddit",
    "subreddit": "transhumanism",
    "author": "ActivityEmotional228",
    "title": "Ohio lawmakers introduced House Bill 469 to ban artificial intelligence from marrying humans or gaining legal personhood. The proposal defines AI as “non-sentient entities,” preventing systems from owning property, running businesses, or holding human rights.",
    "content": "",
    "url": "https://i.redd.it/sjqs2k0b9fxf1.png",
    "score": 298,
    "num_comments": 121,
    "created_at": "2025-10-26 09:06:40+00:00",
    "permalink": "https://reddit.com/r/transhumanism/comments/1ogfy28/ohio_lawmakers_introduced_house_bill_469_to_ban/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ofbe4x",
    "source": "reddit",
    "subreddit": "BlackPeopleTwitter",
    "author": "OkEscape7558",
    "title": "Police and AI, what could go wrong?",
    "content": "",
    "url": "https://i.redd.it/4uwlbifyy4xf1.jpeg",
    "score": 33360,
    "num_comments": 377,
    "created_at": "2025-10-24 22:29:49+00:00",
    "permalink": "https://reddit.com/r/BlackPeopleTwitter/comments/1ofbe4x/police_and_ai_what_could_go_wrong/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ofhi6g",
    "source": "reddit",
    "subreddit": "SeriousConversation",
    "author": "BeGoodToEverybody123",
    "title": "What are jobs that will not be replaced by artificial intelligence?",
    "content": "Every day we hear that artificial intelligence will replace jobs.  Yet, when I look around it's hard to visualize it.\n\nHow is AI going to repair the exhaust system on your car?\n\nHow is AI going to deliver your baby?\n\nHow is AI going to nail shingles on your roof?\n\nHow is AI going to drill a hole to extract oil or water?\n\nHow is AI going to build a bridge across a river?\n\nWhat examples do you have for jobs that AI won't replace?",
    "url": "https://www.reddit.com/r/SeriousConversation/comments/1ofhi6g/what_are_jobs_that_will_not_be_replaced_by/",
    "score": 37,
    "num_comments": 199,
    "created_at": "2025-10-25 03:34:30+00:00",
    "permalink": "https://reddit.com/r/SeriousConversation/comments/1ofhi6g/what_are_jobs_that_will_not_be_replaced_by/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ode7bn",
    "source": "reddit",
    "subreddit": "ArtificialInteligence",
    "author": "plmqazqpalzm",
    "title": "With the rise and development of Artificial intelligence, what will be the top paying careers in 10 to 15 years time?",
    "content": "AI is developing fast and will take over a lot of jobs. What skills would be sensible to learn and which jobs will have a high demand?",
    "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ode7bn/with_the_rise_and_development_of_artificial/",
    "score": 59,
    "num_comments": 175,
    "created_at": "2025-10-22 17:09:48+00:00",
    "permalink": "https://reddit.com/r/ArtificialInteligence/comments/1ode7bn/with_the_rise_and_development_of_artificial/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oh0sn6",
    "source": "reddit",
    "subreddit": "Battlefield6",
    "author": "shybabayaga",
    "title": "Wait a minute",
    "content": "",
    "url": "https://i.redd.it/etxs3s4zvjxf1.jpeg",
    "score": 5642,
    "num_comments": 488,
    "created_at": "2025-10-27 00:39:50+00:00",
    "permalink": "https://reddit.com/r/Battlefield6/comments/1oh0sn6/wait_a_minute/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oe9xr9",
    "source": "reddit",
    "subreddit": "technology",
    "author": "nohup_me",
    "title": "Two federal judges acknowledged their staff's use of artificial intelligence in preparing recent court orders, which were subsequently found to be riddled with errors",
    "content": "",
    "url": "https://www.reuters.com/sustainability/society-equity/two-federal-judges-say-use-ai-led-errors-us-court-rulings-2025-10-23/",
    "score": 1003,
    "num_comments": 18,
    "created_at": "2025-10-23 17:44:33+00:00",
    "permalink": "https://reddit.com/r/technology/comments/1oe9xr9/two_federal_judges_acknowledged_their_staffs_use/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1od2av8",
    "source": "reddit",
    "subreddit": "conspiracy",
    "author": "lone_wolf819",
    "title": "8 days until the return of something humanity was never meant to remember: 3I/ATLAS is coming back",
    "content": "In 2019 astronomers detected an object entering our solar system on a hyperbolic trajectory officially named 3I/ATLAS, the third known interstellar visitor after ‘Oumuamua (2017) and 2I/Borisov (2019). Unlike Borisov, which behaved like a normal comet, 3I/ATLAS showed several anomalies: its brightness fluctuated irregularly, its acceleration couldn’t be fully explained by outgassing, and its albedo reflected a metallic, non-natural pattern.\nAstrophysicist Avi Loeb, former chair of Harvard’s Department of Astronomy, was among the first to suggest that ‘Oumuamua and possibly 3I/ATLAS could represent artificial probes sent by an extraterrestrial civilization. Loeb’s reasoning was simple: both objects lacked the expected cometary tails, yet exhibited accelerations inconsistent with gravitational or solar radiation effects. Their shapes, inferred from light curves, were unusually flat and reflective possibly resembling light sails designed for interstellar travel.\nBut now, all of a sudden, with a bunch of days left before the interstellar object gets closer to us, global summits of extreme importance are suddenly cancelled (Putin-Trump), lockdowns of satellite arrays and quiet movements of high ranking officials (US military official suddenly called all togheter for the first time ever). Bunkers has been built all across the globe over the last few years and the elite moved to safer and hidden locations. Why? They know what's coming.\n\nAncient myths across cultures describe “messengers from the stars” returning after vast cycles, the Sumerian Annunaki, the Egyptian Shemsu-Hor, the Mayan Kukulkan, or the Dogon legends of beings from Sirius. The mathematical precision embedded in monuments like the Great Pyramid of Giza, Teotihuacán, and Tiwanaku aligns eerily with astronomical constants and stellar positions that were supposedly impossible to calculate with ancient technology.\n\nAdvanced life on earth existed in the past, civilizations more developed than us used to walk on this planet before the Sumers, for suddenly disappearing, leaving by just a few traces. All of them were connected to something from the outside.\n3I/ATLAS is not as a random interstellar fragment, but a part of a recurrent cycle, a return of an ancient, intelligent technology that once visited Earth thousands of years ago and left behind architectural and cultural fingerprints.\nPerhaps what ancient civilizations called “gods descending from the heavens” were not divine beings, but observers, and 3I/ATLAS could be their signal that the observation is about to begin again.\nEight days left. Scientists expect the object to navigate through our solar system in a predictable way and ahead out. But it won't. There's nothing predictable about it. Its orbit will suddenly change and ahead straight to Us, and whatever comes next will be a turning point in human history, hands down the most important event ever. It could either be the end of life as we know it, or the biggest turning point in our history.\n\nSomething ancient and out of our comprehension is returning. Enjoy these two months, because after, nothing will ever be the same.\n\nEight days left.",
    "url": "https://i.redd.it/hlfw9nvxemwf1.jpeg",
    "score": 2937,
    "num_comments": 931,
    "created_at": "2025-10-22 08:05:36+00:00",
    "permalink": "https://reddit.com/r/conspiracy/comments/1od2av8/8_days_until_the_return_of_something_humanity_was/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oey0zo",
    "source": "reddit",
    "subreddit": "technology",
    "author": "MetaKnowing",
    "title": "Ohio lawmaker proposes comprehensive ban on marrying AI systems and granting legal personhood | House Bill 469 would label artificial intelligence as 'nonsentient entities' and block legal personhood",
    "content": "",
    "url": "https://www.foxnews.com/tech/ohio-lawmaker-proposes-comprehensive-ban-marrying-ai-systems-granting-legal-personhood",
    "score": 363,
    "num_comments": 61,
    "created_at": "2025-10-24 13:39:35+00:00",
    "permalink": "https://reddit.com/r/technology/comments/1oey0zo/ohio_lawmaker_proposes_comprehensive_ban_on/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oi0lil",
    "source": "reddit",
    "subreddit": "robotics",
    "author": "Nunki08",
    "title": "Researchers at Beijing Academy of Artificial Intelligence (BAAI) trained a Unitree G1 to pull a 1,400 kg car",
    "content": "From BAAI (Beijing Academy of Artificial Intelligence) on 𝕏: [https://x.com/BAAIBeijing/status/1982849203723481359](https://x.com/BAAIBeijing/status/1982849203723481359)",
    "url": "https://v.redd.it/7uuo0a8j8sxf1",
    "score": 518,
    "num_comments": 39,
    "created_at": "2025-10-28 04:48:03+00:00",
    "permalink": "https://reddit.com/r/robotics/comments/1oi0lil/researchers_at_beijing_academy_of_artificial/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1octyv8",
    "source": "reddit",
    "subreddit": "stocks",
    "author": "Puginator",
    "title": "Take Back Tesla campaign urges shareholders to reject Musk $1 trillion pay plan",
    "content": "A day ahead of Tesla’s quarterly earnings report, a coalition of unions and corporate watchdogs wants investors to focus their attention on matters of governance.\n\nOn Tuesday, a group that includes the American Federation of Teachers and Public Citizen launched a website for Take Back Tesla, a campaign urging shareholders to vote against a new pay package for CEO Elon Musk that would net him nearly $1 trillion worth of stock and expand his control over the company.\n\nTesla’s board floated the pay proposal in September, saying the largest ever CEO pay plan was appropriate and necessary to lock Musk in for a decade. The plan is up for a shareholder vote at the company’s annual meeting next month.\n\nOn the Take Back Tesla website, the group calls the outsized package “outrageous,” in part because Musk’s “political activities have damaged Tesla’s brand and distracted him from leadership at Tesla.” The site says the plan doesn’t require Musk to focus more on the automaker than his political interests or other business endeavors.\n\nThe site also encourages the general population to petition state treasurers and other financial officers, who oversee funds on behalf of workers and retirees, to reject the plan. The coalition plans to share materials online that teach investors how to vote their shares or influence fund managers who vote on their behalf.\n\n“Public pension funds are significant shareholders in Tesla, and the asset managers who invest those funds have even larger holdings,” the site says. “That’s our money and we should tell the people who invest it for us that we want them to vote to hold Musk and Tesla Board members accountable.”\n\nAdditional groups in the coalition include Americans for Financial Reform, the Communication Workers of America, corporate watchdog group Ekō, People’s Action and Stop the Money Pipeline.\n\nTesla didn’t immediately respond to a request for comment.\n\nTop proxy firms ISS and Glass Lewis have recommended against authorizing the $1 trillion pay plan, which was disclosed amid a tense battle over Musk’s previous 2018 pay package, which amounted to about $56 billion in stock when it vested.\n\nFollowing those firms’ suggestions, Tesla wrote in a post that, “ISS and Glass Lewis have recommended against Tesla’s proposals time and time again since the 2018 CEO Performance Award was introduced.” The company added that shareholders who sold would “have missed out on our market capitalization soaring by 20x from March 2018 to August 2025.”\n\nThe Delaware Court of Chancery ruled early last year that the 2018 plan was improperly granted by Tesla, with the judge finding that the company hid crucial details from shareholders and that Musk had controlled board members rather than negotiating with them for a fair deal.\n\nMusk appealed the matter to the Delaware State Supreme Court and is seeking to get the 2018 CEO pay package reinstated.\n\nAround the time that plan was rescinded, in January 2024, Musk wrote on his social network X, “I am uncomfortable growing Tesla to be a leader in AI & robotics without having \\~25% voting control.” The new plan would add 12% to his stake over the next decade.\n\nMusk had already started artificial intelligence startup xAI in March 2023, taking some ex-Tesla employees with him, and was developing Grok, a would-be challenger to OpenAI’s ChatGPT.\n\nBy May 2025, Musk said he was committed to running Tesla for at least five more years.\n\nNew York City Comptroller Brad Lander, who oversees a $300 billion pension fund, said he “vociferously opposes this pay package” and says other public fiduciaries should do the same.\n\n“Most of the time we’ve held Tesla stock, it has been a solid investment, it’s grown over time, and that’s why we haven’t chosen to dump it,” Lander, who also serves as finance and accountability chief for the city, said in an interview. Lander said that he’s preferred to “hold on to it and participate in shareholder engagement to address the concerns we have.”\n\nLander manages funds that own about $1.1 billion worth of Tesla, based on holdings reported in August.\n\nHe said he views Tesla’s board he as “insufficiently independent,” and that it’s allowed Musk to be an “absentee CEO.” The company has also failed to hit its marks when it comes to robotaxis and self-driving technology, Lander said.\n\nThe stock has rallied of late after a brutal start to the year, but it’s still underperforming its tech peers and the S&P 500 and Nasdaq in 2025.\n\nMusk has “been an inconsistent CEO at best,” Lander said, “and the pay package is like a ransom attempt after volatile stock performance and destroying consumer confidence.”\n\nTesla is scheduled to report third-quarter results after the close of regular trading on Wednesday. Analysts are expecting revenue growth of 4.7% from a year earlier to $26.37 billion, according to LSEG, following two straight year-over-year declines.\n\nSource: [https://www.cnbc.com/2025/10/21/take-back-tesla-urges-shareholders-to-reject-musk-1-trillion-pay-plan.html](https://www.cnbc.com/2025/10/21/take-back-tesla-urges-shareholders-to-reject-musk-1-trillion-pay-plan.html)",
    "url": "https://www.reddit.com/r/stocks/comments/1octyv8/take_back_tesla_campaign_urges_shareholders_to/",
    "score": 4108,
    "num_comments": 345,
    "created_at": "2025-10-22 00:34:04+00:00",
    "permalink": "https://reddit.com/r/stocks/comments/1octyv8/take_back_tesla_campaign_urges_shareholders_to/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ohfc9l",
    "source": "reddit",
    "subreddit": "stocks",
    "author": "Puginator",
    "title": "Tesla risks losing CEO Musk if $1 trillion pay package isn’t approved, board chair says",
    "content": "Tesla Board Chair Robyn Denholm, in a letter Monday, asked shareholders to vote for CEO Elon Musk’s nearly $1 trillion pay package ahead of the company’s annual meeting.\n\nDenholm said Musk was key to the future of the EV maker as it moves beyond being “just another car company,” with a bigger focus on Full Self Driving and Optimus.\n\n“Without Elon, Tesla could lose significant value, as our company may no longer be valued for what we aim to become,” Denholm wrote.\n\nDenholm told CNBC’s “Squawk Box” on Monday that the company is at an “important inflection point” with artificial intelligence at the forefront.\n\n“The opportunity for Tesla in the future, given this AI focus and attention and the unique capabilities that we have as an organization, and that Elon brings to us, really does mean that the opportunity for the company ahead of us is significant,” she said.\n\nSeveral groups have publicly opposed the pay package in recent days, with proxy advisor Institutional Shareholder Services recommending against it.\n\nLast week, a group of unions and corporate watchdogs launched the Take Back Tesla website to oppose the pay package, noting Musk’s embracing of right-wing political movements and amplifying of conspiracy theories that have damaged the brand.\n\nTesla’s annual meeting is Nov. 6, with the shareholder vote for Musk’s pay and other proposals closing at 11:59 p.m. ET on Nov. 5.\n\nTesla reported third-quarter financials last week, missing earnings expectations but posting a 12% increase in revenue after two straight periods of declines.\n\nThe proposed plan for Musk, which was outlined by the board in September, consists of 12 tranches of shares granted to Musk if Tesla hits certain milestones.\n\nIt would also give Musk increased voting power over the company, which he has publicly demanded for the past year and mentioned again on Tesla’s earnings call last week in reference to the growth of Optimus robots.\n\n“If we build this robot army, do I have at least a strong influence over that robot army?” Musk said to analysts. “I don’t feel comfortable building that robot army if I don’t have at least a strong influence.”\n\nThe full award would give Musk, who already holds about 13% of the EV maker, more than 423 million additional shares and take his stake to about 25%.\n\n“He’s been very consistent in that view, in terms of having enough influence over the vote of Tesla in the future so that bad things can’t happen with the AI,” Denholm told CNBC. “So it’s less about compensation and more about the voting influence.”\n\nDenholm, who noted that retail traders make up about 30% of Tesla’s shareholder base, said last year was a record turnout for the vote.\n\nShe also asked that shareholders vote to re-elect Ira Ehrenpreis, Joe Gebbia and Kathleen Wilson-Thompson to the board.\n\nSource: [https://www.cnbc.com/2025/10/27/tesla-musk-pay-shareholder-vote.html](https://www.cnbc.com/2025/10/27/tesla-musk-pay-shareholder-vote.html)",
    "url": "https://www.reddit.com/r/stocks/comments/1ohfc9l/tesla_risks_losing_ceo_musk_if_1_trillion_pay/",
    "score": 2030,
    "num_comments": 739,
    "created_at": "2025-10-27 14:06:37+00:00",
    "permalink": "https://reddit.com/r/stocks/comments/1ohfc9l/tesla_risks_losing_ceo_musk_if_1_trillion_pay/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oe3lor",
    "source": "reddit",
    "subreddit": "greentext",
    "author": "VolatusCorvi",
    "title": "Artificial intelligence doesn't function in games in this manner.",
    "content": "",
    "url": "https://i.redd.it/reciv9hx7vwf1.jpeg",
    "score": 514,
    "num_comments": 22,
    "created_at": "2025-10-23 13:42:19+00:00",
    "permalink": "https://reddit.com/r/greentext/comments/1oe3lor/artificial_intelligence_doesnt_function_in_games/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ofpe3p",
    "source": "reddit",
    "subreddit": "Futurology",
    "author": "MetaKnowing",
    "title": "Ohio lawmaker proposes comprehensive ban on marrying AI systems and granting legal personhood | House Bill 469 would label artificial intelligence as 'nonsentient entities'",
    "content": "",
    "url": "https://www.foxnews.com/tech/ohio-lawmaker-proposes-comprehensive-ban-marrying-ai-systems-granting-legal-personhood",
    "score": 264,
    "num_comments": 44,
    "created_at": "2025-10-25 11:39:59+00:00",
    "permalink": "https://reddit.com/r/Futurology/comments/1ofpe3p/ohio_lawmaker_proposes_comprehensive_ban_on/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1og1ubo",
    "source": "reddit",
    "subreddit": "CrazyIdeas",
    "author": "Not_a_Replika",
    "title": "Artificial intelligence should have to solve global warming and the healthcare crisis before it is allowed to take our jobs.",
    "content": "Let's see these things prove that they can solve big problems in a way that benefits everybody before we let rich (legally people) corporations program them in a way that benefits the already wealthy few. \n\nLet's see it save the coral reefs and protect rhinoceros and provide universal healthcare all in ways that promote economy and human rights, rather that the crumbling we're seeing when it's barely been released into the wild. (As far as they tell us).\n\nAnd let's see it GENERATE jobs for humans, rather than creeping us back toward the power dynamics we had before the last civil war where rich white men \"earned\" their success through abusive work conditions, unfair pay, and threats to worker and family if you try to escape. \n\nLet's see artificial intelligence bring back and facilitate healthy, physical 3rd places before we let ourselves pay for a subscription to an AI companion already programmed perfectly to replace our friends.\n\nThe rich humans who have no doubt already taught their AI advertisements and social media platforms to divide us and to make us lonely and vulnerable and desperate and angry are doing it wrong. They see money as more valuable than humans. \n\nBut let's see if AI really is as smart as everybody says.",
    "url": "https://www.reddit.com/r/CrazyIdeas/comments/1og1ubo/artificial_intelligence_should_have_to_solve/",
    "score": 127,
    "num_comments": 59,
    "created_at": "2025-10-25 20:31:02+00:00",
    "permalink": "https://reddit.com/r/CrazyIdeas/comments/1og1ubo/artificial_intelligence_should_have_to_solve/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1odcu8h",
    "source": "reddit",
    "subreddit": "nfl",
    "author": "PlayaSlayaX",
    "title": "[Siciliano] Roger Goodell says the NFL is looking into how artificial intelligence can help officiating in the future.",
    "content": "",
    "url": "https://bsky.app/profile/andrewsiciliano.bsky.social/post/3m3sao5spl22u",
    "score": 0,
    "num_comments": 95,
    "created_at": "2025-10-22 16:20:24+00:00",
    "permalink": "https://reddit.com/r/nfl/comments/1odcu8h/siciliano_roger_goodell_says_the_nfl_is_looking/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ogdvv8",
    "source": "reddit",
    "subreddit": "IsaacArthur",
    "author": "KerbodynamicX",
    "title": "Could artificial super-intelligence govern a country better than humans?",
    "content": "Humans leadership have many flaws. Intrinsically, the rate which humans can input, process and output data is very limited, often only around 10 bytes per second, which means no single person will ever know every aspect of the country they are in. But with superintelligent AI in the future, should have no problem in processing detailed information from every single aspect of the society, from industrial output, to infrastructure and economics, and maybe even to give personalized career advice to every single person based on these info. It also circumvents the problem of human leaders changing policies and handing out contracts for their own monetary gain, and would certainly have no interest in a certain island that harms children. So, will this happen in the future? Or is having humans controlled by machines a very dangerous situation to be in? ",
    "url": "https://www.reddit.com/r/IsaacArthur/comments/1ogdvv8/could_artificial_superintelligence_govern_a/",
    "score": 21,
    "num_comments": 75,
    "created_at": "2025-10-26 06:52:23+00:00",
    "permalink": "https://reddit.com/r/IsaacArthur/comments/1ogdvv8/could_artificial_superintelligence_govern_a/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oibjn9",
    "source": "reddit",
    "subreddit": "wikipedia",
    "author": "Stefan_S_from_H",
    "title": "Grokipedia is an artificial intelligence (AI)-powered online encyclopedia developed by xAI, an AI company founded by Elon Musk […] Many articles are derived from Wikipedia articles, with some articles observed to be copied nearly verbatim.",
    "content": "",
    "url": "https://en.wikipedia.org/wiki/Grokipedia",
    "score": 231,
    "num_comments": 35,
    "created_at": "2025-10-28 14:54:18+00:00",
    "permalink": "https://reddit.com/r/wikipedia/comments/1oibjn9/grokipedia_is_an_artificial_intelligence/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ohvr76",
    "source": "reddit",
    "subreddit": "CAStateWorkers",
    "author": "Melodic_Animal_2238",
    "title": "Artificial Intelligence and State Work",
    "content": "In my division and department, we are being encouraged to use Microsoft CoPilot quite a bit for work tasks that do not include confidential information. This concerns me quite a bit because of the economically destructive use of AI in many sectors of our economy. AI is quite literally destroying jobs that humans would otherwise have in many different industries right now. For example, this is especially the case in the legal profession where entry level associates are being replaced with AI chatbots to do basic legal functions. This is one widely reported example, but there are many other instances of AI already taking the place of people in today's economy.\n\nMy deputy director has suggested using AI to work \"smarter not harder\" in order to automate items that could be done through AI faster and easier than with a human employee. If it wasn't already clear, AI has the humongous potential (and some would say goal) of being able to replace humans in the highest number of jobs possible, especially office desk jobs.\n\nAnd as mentioned in the video below, we can accurately predict the outcome of new and disrupting technologies such as AI when we can identify the incentives. The incentives in this case are clear. The more work that can be done by AI, the less need there are for expensive human workers to be hired. It may happen more slowly in state employment than private industry because of protections from being laid off, but with nothing to challenge it, AI would likely considerably reduce state employment opportunities by allowing management to simply not backfill roles after workers leave their positions.\n\nIs anyone else's management pushing the use of AI? Do others have similar concerns as this?\n\nWhat are our unions doing about this? I think we need to make a bigger deal about this to our unions and push them to address it before it becomes such a large issue that it's too hard to sufficiently reign it in.\n\nHere is a great video with Jon Stewart talking with Tristan Harris (Co-founder of the Center for Humane Technology) about the dangers of Unregulated AI on Humanity & the Workforce. While some of the scenarios they describe are more extreme than what we would likely encounter at the state, they nonetheless illustrate the dangerous potential of AI: [https://www.youtube.com/watch?v=675d\\_6WGPbo](https://www.youtube.com/watch?v=675d_6WGPbo)",
    "url": "https://www.reddit.com/r/CAStateWorkers/comments/1ohvr76/artificial_intelligence_and_state_work/",
    "score": 38,
    "num_comments": 69,
    "created_at": "2025-10-28 00:44:17+00:00",
    "permalink": "https://reddit.com/r/CAStateWorkers/comments/1ohvr76/artificial_intelligence_and_state_work/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ogyhee",
    "source": "reddit",
    "subreddit": "videogames",
    "author": "EchoParty9274",
    "title": "Do games really need to get better looking than this with the foreseeable technology?",
    "content": "This video is from Battlefield 1, 2016, minimum requirements:\n\n>AMD FX-6350 Processor (Intel) or Intel Core i5 6600K\n\n>8GB RAM\n\n>Radeon™ HD 7850 2GB or  GTX 660 2GB\n\n>50GB storage\n\nI don't know about you guys, but these graphics already look realistic enough. Arguably you would need better requirements for maximum graphics but still, don't you think this is good enough?\n\nEver since I got Oblivion Remastered I've come to dislike UE5 and other forms of \"hyper realistic graphics\" for what they usually do to performance. And I've come to see that this feeling is not exactly strange nor isolated.\n\nSo, isn't this enough for playing on big screens with a keyboard or a controller while sitting in a chair or couch? If things aren't actively moving towards hyper virtual reality or some artificial intelligence thing, what's the need of trying to push for graphics when we already got things like that video?\n\nMy two cents, from an Unreal Engine 5 hater.\n\nEDIT: Ok, looks a little blurry but that's after upload. On my PC it looks like it released today.",
    "url": "https://v.redd.it/c8gazzzobjxf1",
    "score": 1903,
    "num_comments": 365,
    "created_at": "2025-10-26 22:53:42+00:00",
    "permalink": "https://reddit.com/r/videogames/comments/1ogyhee/do_games_really_need_to_get_better_looking_than/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ogdrco",
    "source": "reddit",
    "subreddit": "AskPhysics",
    "author": "Efficient_Sky5173",
    "title": "In principle, could a superintelligent artificial intelligence prevent the heat death of the universe?",
    "content": "\nGiven that the heat death of the universe is derived from current physical laws describing passive systems, could a future superintelligent civilization, millions of times beyond human intelligence, in principle, develop the means to intervene in cosmic evolution and prevent or reverse the heat death of the universe? In other words, is the heat death truly inevitable under all possible future physical understanding, or only under our present one?",
    "url": "https://www.reddit.com/r/AskPhysics/comments/1ogdrco/in_principle_could_a_superintelligent_artificial/",
    "score": 0,
    "num_comments": 78,
    "created_at": "2025-10-26 06:44:19+00:00",
    "permalink": "https://reddit.com/r/AskPhysics/comments/1ogdrco/in_principle_could_a_superintelligent_artificial/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1odbs83",
    "source": "reddit",
    "subreddit": "stocks",
    "author": "Puginator",
    "title": "Meta lays off 600 employees within AI unit",
    "content": "Meta will lay off roughly 600 employees within its artificial intelligence unit as the company looks to reduce layers and operate more nimbly, a spokesperson confirmed to CNBC on Wednesday.\n\nThe company announced the cuts in a memo from its Chief AI Officer Alexandr Wang, who was hired in June as part of Meta’s $14.3 billion investment in Scale AI. Workers across Meta’s AI infrastructure units, Fundamental Artificial Intelligence Research unit and other product-related positions will be impacted.\n\nAxios was first to report the cuts.\n\nMeta has been aggressively investing in AI as it works to keep pace with rivals like OpenAI and Google, pouring billions of dollars into infrastructure projects and recruitment.\n\nOn Tuesday, the company announced a $27 billion deal with Blue Owl Capital to fund and develop its massive Hyperion data center in rural Louisiana. The data center is expected to be large enough to cover a “significant part of the footprint of Manhattan,” Meta CEO Mark Zuckerberg said in a post in July.\n\nSource: [https://www.cnbc.com/2025/10/22/meta-layoffs-ai.html](https://www.cnbc.com/2025/10/22/meta-layoffs-ai.html)",
    "url": "https://www.reddit.com/r/stocks/comments/1odbs83/meta_lays_off_600_employees_within_ai_unit/",
    "score": 2042,
    "num_comments": 328,
    "created_at": "2025-10-22 15:41:49+00:00",
    "permalink": "https://reddit.com/r/stocks/comments/1odbs83/meta_lays_off_600_employees_within_ai_unit/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1ohv9ru",
    "source": "reddit",
    "subreddit": "Fauxmoi",
    "author": "demimonde9",
    "title": "Amazon set to lay off up to 30,000 corporate employees Tuesday. Amazon CEO Andy Jassy said in June that the increased use of artificial intelligence tools would likely lead to further job cuts, particularly through automating repetitive and routine tasks.",
    "content": "",
    "url": "https://www.reuters.com/business/world-at-work/amazon-targets-many-30000-corporate-job-cuts-sources-say-2025-10-27/",
    "score": 223,
    "num_comments": 33,
    "created_at": "2025-10-28 00:22:00+00:00",
    "permalink": "https://reddit.com/r/Fauxmoi/comments/1ohv9ru/amazon_set_to_lay_off_up_to_30000_corporate/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oic5hq",
    "source": "reddit",
    "subreddit": "Washington",
    "author": "chiquisea",
    "title": "Amazon cuts 14,000 corporate jobs as spending on artificial intelligence accelerates",
    "content": "",
    "url": "https://www.kuow.org/stories/amazon-cuts-14-000-corporate-jobs-as-spending-on-artificial-intelligence-accelerates",
    "score": 178,
    "num_comments": 38,
    "created_at": "2025-10-28 15:17:16+00:00",
    "permalink": "https://reddit.com/r/Washington/comments/1oic5hq/amazon_cuts_14000_corporate_jobs_as_spending_on/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  },
  {
    "post_id": "1oi9bh0",
    "source": "reddit",
    "subreddit": "LiveFromNewYork",
    "author": "VestigialTales",
    "title": "Kyle M. Apology Post",
    "content": "He’s really really sorry, you guys - but who among us hasn’t been led astray by Riley and his older brothers? I’m glad he’s finally taking responsibility - and listenin’ back. ",
    "url": "https://www.reddit.com/gallery/1oi9bh0",
    "score": 2173,
    "num_comments": 279,
    "created_at": "2025-10-28 13:26:45+00:00",
    "permalink": "https://reddit.com/r/LiveFromNewYork/comments/1oi9bh0/kyle_m_apology_post/",
    "workflow": "query",
    "search_query": "artificial intelligence"
  }
]